<?php

    return [
        'projettitel'=>'للتعلم مودو',
        'hi'=>'مرحبا',
        'name'=>'الاسم',
        'phone'=>'رقم الهاتف',
        'login'=>'تسجيل الدخول ',
        'forgot'=>'نسيت كلمة المرور',
        'loginnav'=>'الدخول',
        'register'=>'التسجيل ',
        'logout'=>'تسجيل الخروج ',
        'email'=>'البريد الالكتروني ',
        'alert1'=>'تم اضافة الدورة الى السلة بنجاح',
        'alert2'=>'! يمكنك اضافة المزيد . تابع التصفح',
        'emailvery'=>'تأكيد البريد الالكتروني',
        'emailvery1'=>'تم ارسال الرابط بنجاح',
        'emailvery2'=>'مرحبا بك في موقعنا . يرجى الضغط على الرابط الذي وصلك عن طريق الايميل الذي قمت بتسجيله  ,',
        'emailvery3'=>' اضغط هنا لارسال الرابط',
        'password'=>'كلمة المرور ',
        'password1'=>'تأكيد كلمة المرور',
        'erremail' => 'تم استخدام البريد الإلكتروني بالفعل.',
        'errpass' => 'حقل تأكيد كلمة المرور غير مطابق أو كلمة المرور لا تحتوي على 6 أحرف.',
        'btnlog'=>'الدخول',
        'res'=>'انشاء حساب ؟',
        'navtitle' => 'إبدأ رحلة التعلم',
        'courslive' => 'دورات مباشرة',
        'buttonnav' =>  'المواضيع',
        'bigtitel' =>  'تعلم اليوم، لتَقُد غداً',
        'subtitel' => 'تعلم.. طور.. وحقق نجاحك مع أكاديمية المبتكر',
        'card1' => 'معتمدون دولياً',
        'card1.1' => 'مركز تدريب واختبار معتمد',
        'card2' => 'مدربون محترفون',
        'card2.1' => 'ذوي كفاءة عالية ومعتمدون دوليأ',
        'card3' => 'تنوع في التدريب',
        'card3.1' => 'عن بعد (مباشر) – قاعة دراسية',
        'livtitel' => 'نظام التعلم عن بعد',
        'livtitel1' => 'بخاصية البث المباشر',
        'livtitel2' => 'يمكنك الإلتحاق بالدورات التي تعقد في الأكاديمية دون الحاجة للتواجد داخل القاعة التدريبية',
        'livbtn' => 'اعرف المزيد',
        'cmt1' => 'آراء',
        'cmt2' => 'العملاء',
        'cnt1.1'=>'نتقدم بخالص الشكر ووافر التقدير على ما تبذلونه من جهود مثمرة ومتواصلة فيما يتعلق بالدورات التدريبية التي قدمت لموظفي شركة كراون الشرق الأوسط لصناعة العبوات لافتين النظر الى اسلوبكم البسيط والعملي في ايصال',
        'cnt1.2'=>'محمد الشعلان',
        'cnt1.3'=>'مدير دائرة الامداد',
        'cnt2.1'=>'لا يسعنا إلا أن نشكر لكم جهودكم المتميزة والحثيثة وتعاونكم معنا في تدريب موظفي مكتبنا من أجل رفع كفاءة ومهنية الموظفين. آملين أن نستمر معكم في دورات أخرى قادمة,',
        'cnt2.2'=>'هشام عبدالله',
        'cnt2.3'=>'مدير مكتب الشركة العامة للمعارض',
        'cnt3.1'=>'يسر إدارة شركة جازان للاستشارات التسويقية أن تتقدم إلى إدارة أكاديمية الرواد للتدريب والاستشارات بجزيل الشكر والثناء على المجهود المميز والأداء',
        'cnt3.2'=>'محمد الحربي',
        'cnt3.3'=>'مدير عام شركة جازان للاستشارات التسويقية',
        'ft1'=>'تبحث عن تدريب',
        'ft2'=>'مهما كانت الدورة التدريبية التي تبحث عنها! تقدم أكاديمية المبتكر مجموعة واسعة من الدورات التدريبية والدبلومات في مجالات مختلفة، مثل الإدارة, المحاسبة, التسويق, التصميم الجرافيكي, الهندسة, البرمجة, الشبكات, واللغات. قم بتنزيل كتيبات الدورات الآن!',
        // page live
        'lt1'=>'طور مهاراتك',
        'lt2'=>'وأنت',
        'lt2.1'=>'في مكانك!',
        'lt3'=>'تعلم عن بعد... وتميز بشهادات',
        'lt4'=>' معتمدة دولية',
        'lt5'=>'أكثر من ',
        'lt6'=>'دورة في مختلف التخصصات الأكثر طلباً',
        'lt7'=>'محلياً وعالمياً!',
        'sub1'=>'مكان واحد لإدارة جميع تفضيلاتك المالية والأكاديمية',
        'sub2'=>'خيارات الكترونية متعددة للدفع',
        'sub3'=>'نسخة مسجلة من فصل التدريب في حال فاتك الجلسة الحية',
        'sub4'=>'الفريق العمل المتميز لتقديم المساعدة (الدعم الفني)',
        'bg1'=>'تصفح الدورات التدريبية',
        'bg2'=>'اختر الدورة التدريبية التي ترغب في الالتحاق بها',
        //page live course
        '1t'=>'تدريب مباشر',
        '2t'=>'دورات',
        '3t'=>'مباشرة',
        '4t'=>'دورات مباشرة',
        'in1'=>'ساعة',
        'in2'=>'دولار',
        'btn1'=>'التفاصيل',
        'btn2'=>' اضافة الى السلة',
        //page course watche
        'tt1'=>'مدة الدورة : ',
        'tt2'=>'التدريب المتوفر ',
        'tt3'=>'تدريب اونلاين',
        'tt4'=>' السعر الكلي :',
        'subt1'=>'دورة تدريبية',
        'subt2'=>'مخرجات الدورة',
        'subt3'=>'المحاور',
        'subt4'=>'أضف الدورة الى السلة',
        'subt5'=>'دورات أخرى يمكنك مشاهدتها',
        //car page
        'ct1'=>'سلة المشتريات',
        'ct2'=>'محتويات السلة',
        'ct3'=>'يمكنك الان اتمام عملية الشراء',
        'ct4'=>'مرحبا بك يا',
        'ct5'=>'في موقعنا',
        'ct6'=>'يتوجب عليك',
        'ct7'=>'تسجيل الدخول ',
        'ct8'=>'لتتمكن من  اتمام عملية الشراء',
        'ct9'=>'محتويات السلة ',
        'ct10'=>' المجموع الكلي لمشترياتك هو',
        'ct11'=>'ادفع الان',











        ]




?>
