-- phpMyAdmin SQL Dump
-- version 6.0.0-dev+20231004.3c21a0e0d2
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1
-- Généré le : dim. 08 Oct. 2023 à 19:19
-- Version du serveur : 10.4.24-MariaDB
-- Version de PHP : 8.1.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `academy`
--

-- --------------------------------------------------------

--
-- Structure de la table `addtocarts`
--

CREATE TABLE `addtocarts` (
  `id` int(11) DEFAULT NULL,
  `name` varchar(300) NOT NULL,
  `userid` varchar(300) NOT NULL,
  `price` varchar(300) NOT NULL,
  `image` varchar(300) NOT NULL,
  `updated_at` varchar(255) NOT NULL,
  `created_at` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `addtocarts`
--

INSERT INTO `addtocarts` (`id`, `name`, `userid`, `price`, `image`, `updated_at`, `created_at`) VALUES
(NULL, 'ادوبي افتر افكت', '1', '198 ', 'ae.jpeg', '2023-10-07 22:24:45', '2023-10-07 22:24:45'),
(NULL, 'تطوير المواقع الإلكترونية Asp.net core', '2', '212 ', 'aps.net.png', '2023-10-07 22:31:48', '2023-10-07 22:31:48'),
(NULL, 'سكتش أب', '2', '212', 'skatch.png', '2023-10-07 22:32:24', '2023-10-07 22:32:24'),
(NULL, 'تصميم الأعمال الميكانيكية', '2', '599', 'مراحل-الأعمال-الميكانيكية-في-التشييد-والبناء.jpeg', '2023-10-07 22:42:45', '2023-10-07 22:42:45'),
(NULL, 'ادوبي فوتوشوب', '1', '212', 'ps.jpg', '2023-10-08 07:51:06', '2023-10-08 07:51:06'),
(NULL, 'ادوبي فوتوشوب', '1', '212', 'ps.jpg', '2023-10-08 07:51:54', '2023-10-08 07:51:54'),
(NULL, 'ادوبي افتر افكت', '1', '198 ', 'ae.jpeg', '2023-10-08 17:13:29', '2023-10-08 17:13:29');

-- --------------------------------------------------------

--
-- Structure de la table `allrecords`
--

CREATE TABLE `allrecords` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `time` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `langue` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `id-course` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `desc1` varchar(10000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `allrecords`
--

INSERT INTO `allrecords` (`id`, `name`, `image`, `price`, `time`, `langue`, `id-course`, `desc1`, `created_at`, `updated_at`) VALUES
(1, 'علم البيانات\nباستخدام بايثون', 'python-data.png', '465 ', '60', '', '1', 'صُممت دورة علم البيانات باستخدام لغة بايثون باستخدام Python لتمكين المشاركين من تحليل البيانات والتنبؤ بالعديد من مشكلات الحياة الواقعية باستخدام العديد من مجموعات البيانات الواقعية باستخدام خوارزميات ML الأكثر شيوعًا مثل التصنيف والتجميع بمساعدة لغة برمجة .Python\n\nتركز الدورة على المهارات الأساسية المطلوبة لعالم البيانات، حيث يتم تمكين المشتركين من أساسيات البرمجة باستخدام Python، بالإضافة إلى الموضوعات المتقدمة مثل التعلم العميق والتعتيم ونشر النماذج، باستخدام أحدث المعارف والتقنيات في هذا المجال.', NULL, NULL),
(2, 'تطوير المواقع الإلكترونية Asp.net core', 'aps.net.png', '212 ', '20', '', '1', '\nصممت دورة تطوير المواقع الإلكترونية asp.net core لتمكين المشاركين من إنشاء العديد من أنواع التطبيقات المختلفة باستخدام نظام أساسي للمطورين يتكون من أدوات ولغات برمجة ومكتبات، حيث يعمل ASP.NET  بشكل أسرع من أي إطار عمل ويب معروف، إذ يدعم بروتوكولات المصادقة القياسية في الصناعة.\n\nفي هذه الدورة سيتمكن المشارك من تطوير C# باستخدام ASP.NET CORE MVC وذلك عن طريق استخدامVisual Studio ، بالإضافة إلى التمكّن من إنشاء تطبيق ويبC# ASP.NETCORE MVC ، وإجراء تغييرات عليه، كما سيتمكّن المشترك من استكشاف بعض ميزاتIDE  قبل التمكن من تشغيل التطبيق. كما تهدف هذه الدورة إلى تعريف المشارك بلغة البرمجة لاستخدام التقنيات الرئيسية المستخدمة في البرمجة كائنية التوجهOOP ، إضافة إلى إلمام المشاركين بمفاهيم تعريفية وتطبيقية لـ HTMLو MVC..\n\nمن خلال دورة ASP.net CORE MVC سيتم تمكين المشاركين من إنشاء مواقع ديناميكية وتعلّم كيفية التحكم بها وتطويرها، حيث تتضمن الدورة لعديد من المحاور التي تمكن المستخدم من تطوير هذه المواقع وإنشاء تطبيقات متطورة تستخدم أحدث معايير الويب، بالإضافة إلى تطوير الخدمات ونشرها في البيئات المختلطة بما في ذلك الخوادم المحلية Windows   Azure.\n\nسيتمكّن المشتركون من خلال هذه الدورة من استخدام تطبيقات الويب في Azure لنشر موقع الويب الخاص بهم، مما سيطوّر من مهاراتهم في إدارته بسهولة دون الحاجة إلى العمل مع الخوادم الأساسية، أو وحدات التخزين، أو أصول الشبكة، كما يمكنهم التركيز على ميزات موقع الويب الخاص بهم والاعتماد على نظام Azure الأساسي لتوفير وصول آمن إلى موقعهم، بالإضافة إلى تعريف المشتركين بكيفية تنفيذ ميزات الأمان في التطبيق.', NULL, NULL),
(5, 'تطوير تطبيقات الهاتف باستخدام برنامج Flutter', 'flutter.jpeg', '420 ', '30', '', '1', 'Flutter عبارة عن مجموعة تطوير برامج واجهة مستخدم مفتوحة المصدر تم إنشاؤها بواسطة Google يتم استخدامها لتطوير تطبيقات Android و iOS و Linux و Mac و Windows و Google Fuchsia والويب من قاعدة بيانات واحدة.\n\n \n\nتركز هذه الدورة على بناء المهارات الأساسية التي تمكن المتدرب من بناء تطبيقات Android و IOS باستخدام flutter ، بالإضافة إلى معرفة قوية بلغة برمجة  .Dart\n\n ', NULL, NULL),
(6, 'Microsoft Azure Security Technologies AZ-500', 'microsoftsecurity.jpeg', '353 ', '35', '', '2', '\nتقدم هذه الدورة لمحترفي مجال أمان تكنولوجيا المعلومات الذين ينفذون ضوابط الأمان ويديرون الهويات ويحمون البيانات والتطبيقات في المؤسسات، حيث ستتمكن خلال الدورة من معرفة كيفية إدارة هويات Azure والوصول إليها، وتحديد آليات حماية البيانات وتأمينها، وتأمين بروتوكولات الإنترنت على Azure.', NULL, NULL),
(7, 'Microsoft MCSA 2016\nمساعد الحلول المعتمد\n', 'mcsa.jpg', '677 ', '90', '', '2', 'تهدف دورة MCSA إلى تزويد المشاركين بالمعرفة اللازمة حول أحدث الانظمة والتقنيات المرتبطة بـ Server Management والخاص بشركة Microsoft وتمكينهم من العمل عليها وإدارتها والتعامل مع قواعد بيانات موارد الشبكة والخدمات والمستخدمين وخدمات شبكات مايكروسوفت والأمن والتحكم عن بعد ومعرفة مفاهيم التصميم بحيث تشمل الدورة تدريباً شاملاً للتمكن من استخدام حلول مايكروسوفت عن طريق تكنولوجيا عالية الجودة ومختبرات مجهزة بشكل كامل.', NULL, NULL),
(8, 'مقدمة في علم التشفير', 'crypto.png', '127 ', '90', '', '2', 'تهدف دورة MCSA إلى تزويد المشاركين بالمعرفة اللازمة حول أحدث الانظمة والتقنيات المرتبطة بـ Server Management والخاص بشركة Microsoft وتمكينهم من العمل عليها وإدارتها والتعامل مع قواعد بيانات موارد الشبكة والخدمات والمستخدمين وخدمات شبكات مايكروسوفت والأمن والتحكم عن بعد ومعرفة مفاهيم التصميم بحيث تشمل الدورة تدريباً شاملاً للتمكن من استخدام حلول مايكروسوفت عن طريق تكنولوجيا عالية الجودة ومختبرات مجهزة بشكل كامل.', NULL, NULL),
(9, 'مايكروسوفت أزور - Microsoft Azure AZ-104', 'Azure.png', '705', '35', '', '2', 'صممت دورة  Microsoft Azure Administrator Associate AZ-10لتمكين المشاركين من إنشاء تجارب متعددة المنصات مترابطة ومصممة خصيصًا لتفاعلات العملاء باستخدام الذكاء الاصطناعي والتعلم الآلي، حيث سيتعلم المشاركون كيفية إدارة اشتراكات Azure الخاصة بهم، كما سيتمكنون من تطبيق ممارسات إدارة الهويات الآمنة، وإدارة البنية التحتية.\r\n\r\nكما تساعد هذه الدورة على تطوير قدرة المشاركين على تكوين الأنظمة الوهمية، لتزود المشاركين بكيفية توصيل Azure مع المواقع المحلية، وإدارة حركة مرور الشبكة، بالإضافة إلى التطرق إلى تنفيذ حلول التخزين، مما يرفع من مهارة المشاركين في إنشاء أجهزة افتراضية وتوسيع نطاقها.', NULL, NULL),
(10, 'أمن المعلومات +Security', 'security.jpeg', '170', '30', '', '2', 'ضمان أمن وسلامة الشبكات والمعلومات الشخصية أحد أهم الأمور التي يبحث عنها مستخدمي الحواسيب والأجهزة المحمولة والذكية، لذلك تعتبر هذه الدورة مرجعاً أساسياً ومهماً لك لضمان الحصول على المعلومات والمعرفة اللازمة لتحديد التهديدات الأمنية التي قد تهدد شبكتك الخاصة وتقوية الأنظمة والبنية التحتية الأمنية.\r\n\r\nتؤهلك الدورة للنجاح في امتحان كومبتيا أمن الحاسوب CompTIA Security +، حيث تتضمن تعريفاً شاملاً بالمواضيع المختلفة في مجال أمن وحماية الحواسيب والشبكات، وكذلك مدى ارتباط مجال أمن الشبكات بالمجالات الأخرى في تكنولوجيا المعلومات.', NULL, NULL),
(11, 'فني الخوادم Server+', 'sever.jpg', '254', '30', '', '2', 'صممت الدورة التدريبية فني الخوادم  لرفع كفاءة  المشاركين بالمعرفة والمهارات اللازمة لبناء وصيانة واستعادة ودعم وتأمين  وتقنيات البرمجيات الخاصة بالخادم ، بما في ذلك المحاكاة الافتراضية.\r\n\r\nتهدف الدورة التدريبية أيضًا إلى تحديد المشكلات البيئية وفهم إجراءات الامتثال للأمن والحماية العامة والامتثال لها ، والتعرف على مصطلحات ومفاهيم الصناعة وفهم أدوار الخادم وتفاعلها في بيئة الحوسبة الديناميكية.', NULL, NULL),
(12, 'متخصص تقنيات سيسكو لشبكات المؤسسات - CCNP (ENCOR)', 'CCNP.jpeg', '550 ', '70', '', '2', ' تم تصميم دورة متخصص تقنيات سيسكو لشبكات المؤسسات لإثراء المعرفة والمهارات اللازمة لتكوين الشبكات السلكية واللاسلكية للمؤسسات واستكشاف الأخطاء وإصلاحها وإدارتها.\r\n تمكّنك الدورة من تطبيق مبادئ الأمان داخل شبكة المؤسسة وكيفية تراكب تصميم الشبكة باستخدام حلول مثل SD-Access و SD-WAN.، بالاضافة الى اعدادك لأداء امتحان 350-401 لتطبيق تقنيات (Cisco Enterprise Network Core (ENCOR', NULL, NULL),
(13, 'الهاكر الأخلاقي المعتمد CEH', 'hackers.jpeg', '972', '70', '', '2', 'صممت دورة الهاكر الأخلاقي المعتمد CEH لتمكين المشترك من فهم أنظمة المعلومات والشبكات وأنظمة الحماية والأمان، حيث سيتم تعريف المشترك خلال الدورة على أبز التهديدات الأمنية التي تواجه أنظمة الشبكات والمعلومات وناقلات الهجوم المتقدمة، وأحدث تقنيات القرصنة.\r\n\r\nسيتم تعريف المشترك خلال الدورة بأهم المنهجيات والأدوات والحيل والتدابير الأمنية الواجب اتباعها لتحديد نقاط الضعف في الأنظمة المعلوماتية المستهدفة وذلك باستخدام الأدوات التي يستخدمها الهاكر لتقييم الوضع الأمني للنظام، حيث سيتم تدريب المشترك عملياً في مختبرات متقدمة وجلسات تفاعلية خاصة بكل موضوع نظري', NULL, NULL),
(14, 'مساعد شبكات معتمد CCNA', 'ccna.jpeg\r\n', '229 ', '80', '', '2', 'صممت دورة مساعد شبكات معتمد CCNA لتزويد المشتركين بالمهارات والمعرفة اللازمة التي تمكنهم من إدارة أجهزة التبديل والتحويل بما في ذلك تركيب وإعداد وتشغيل وصيانة هذه الأجهزة، بالإضافة إلى فهم عناوين بروتوكول الإنترنت IP بشكل مفصل، وفهم الشبكات الفرعية والتشغيلية.\r\n\r\nسيتمكن المشترك خلال الدورة من إدراك كيفية تدفق البيانات في الشبكة وفقاً لنموذج الربط البيني للأنظمة المفتوحة OSI، وتوصيل الأسلاك والكابلات مثل UTP وSTP، وتهيئة بروتوكولات التوجيه مثل RIP وOSPF وEIGRP، بالإضافة تعلّم كيفية تهيئة قوائم الوصول وترجمة عناوين الشبكة لتوصيل الموجه بالإنترنت، مما يساعد المشترك على فهم كافة المهارات المتخصصة في مجال أمن الشبكات والشبكات اللاسلكية.', NULL, NULL),
(15, 'تدريب المدربين', 'ent.jpg', '493', '30', '', '3', 'صممت دورة تدريب المدربين لإلمام المشاركين بأكثر الطرق فعالية في تحويل المعلومات إلى مهارات وتطبيقات عملية، حيث تركز هذه الدورة على مشاركة الأفكار والخبرات بدلا من التركيز على مجرد نقل المعلومات، لتساهم في بناء قدرات المشاركين وتطوير مهاراتهم في تنفيذ الخطط التدريبية.\r\n\r\nكما تهدف هذه الدورة إلى تطوير إدارة الموارد البشرية في المنظمة مع التركيز على قدرات المدرب ومهاراته التدريبية بدلا من التركيز على اكتساب المعرفة فقط، كما سيتعرف المشاركون على الأساليب المختلفة لتقييم الاحتياجات التدريبية، إذ ستتوفر لديهم أسس وهياكل استراتيجية التدريب التي من خلالها سيتحقق التنفيذ المستدام للممارسات الجديدة.', NULL, NULL),
(16, 'إعداد المدرب الشخصي', 'gym.jpg', '211', '35\r\n', '', '3', 'دورة تدريبية\r\nتهدف دورة إعداد المدرب الشخصي إلى مساعدة المشاركين على دراسة مدى تأثير الرياضة على وظائف الأعضاء وتركيبة الجسم لتمكينهم من اكتساب المعرفة والخبرة اللازمة في إعداد برامج التدريب وتقييمات اللياقة واستخداماتها، بحيث تغطي الدورة محاور التشريح العضلي، فسيولوجيا التدريب الرياضي، علم الحركة والميكانيكا الحيوية، الإعداد البدنى ومبادىء التدريب، التغذية الرياضية الصحيحة، المكملات الغذائية، تقييم اللياقة البدنية، كيفية تصميم البرنامج التدريبي، وكيفية التعامل مع المتدرب.', NULL, NULL),
(17, 'اكسل - المستوى الأساسي والمتوسط', 'exel.jpeg', '212 ', '20', '', '3', 'تمكنك الدورة من احتراف استخدام برنامج اكسل الذي يعتبر أحد أهم برامج شركة مايكروسوفت في مختلف المجالات، حيث ستتمكن من اتقان كافة مهارات وعمليات البرنامج من تحليل البيانات والحسابات والميزانيات والفواتير، بالإضافة إلى استخدام الجداول البيانية لتنفيذ العمليات الحسابية الأساسية والمتقدمة، وفهم كيفية إضافة وحذف الصفوف والأعمدة.\r\n\r\nبعد الانتهاء من الدورة ستكون قادراً على القيام بالمهام العملية المختلفة باحترافية أكثر والاستفادة من البرنامج بالطريقة الصحيحة', NULL, NULL),
(18, 'اكسل - المستوى المتقدم', 'exel.jpeg', '212', '26', '', '3', 'يُعدّ إتقان استخدام برنامج مايكروسوفت اكسل Excel من المهارات الأساسية التي على كل محترف الإلمام بها، فتم تصميم دورة اكسل المتقدم على نحوٍ يمكّن المشاركين من الإلمام بالمهارات العملية اللازمـة لاستخدام برنامج اكسل والتمكّن من أدواته المختلفة بما فيها طرق إعداد وبناء المعادلات والمقارنات والجداول المحورية واستخراج البيانات اللازمة لاتخاذ القرارات، بحيث سيقومون بتحليل البيانات بشكل متقدم و استخراج النتائج لاتخاذ القرار السليم والمناسب باستخدام الصيغ الرياضية المتقدمة واستخدام الخيارات اللازمة لتحليل البيانات واستعراضها.', NULL, NULL),
(19, 'المحاسبة العملية', 'calcul.jpg', '352 ', '20', '', '3', '\r\nصُممت دورة المحاسبة العملية لتأهيل المشتركين لدخول مجالات العمل المختلفة في مهنة المحاسبة، حيث يتم خلال الدورة تعريف المشتركين بأهم متطلبات العمل في مهنة المحاسبة وتطوير مهاراتهم الفنية لمواكبة التطورات الحديثة في هذه المهنة.\r\n\r\nتهدف الدورة إلى اكساب المشتركين العديد من المهارات المالية والفنية وتعزيز قدراتهم على استخدام أحدث التقنيات المحاسبية من أجل الوصول إلى الوظيفة المثالية والعصرية.\r\n\r\nتتضمن الدورة محاور تقدم تطبيقات وحالات عملية لتسجيل العمليات المالية وإعداد القوائم المالية من خلال الحاسوب ومناقشتها باستخدام أساليب العصف الذهني، بالإضافة إلى تزويد المشترك بتطبيقات ودراسات عملية في مجال المحاسبة والعمليات المالية', NULL, NULL),
(20, 'البرنامج التدريبي للعاملين بالعمل الانساني الخيري', 'azrty.webp', '353 ', '16', '', '3', 'يساهم بناء قدرات العاملين في المؤسسات الخيرية وتعزيز دورها في التنمية البشرية في تحقيق التنمية المستدامة والمساعدة في رسم السياسات والخطط وعمل الحملات التسويقية والترويجية والتعامل مع وسائل الإعلام، وتسليط الضوء على دور العلاقات وأهميته كمحرك رئيس للمنظمات الخيرية، وغيرها من المحاور الرئيسة التي لا بد من الوقوف عندها', NULL, NULL),
(21, 'دبلوم ادارة الموارد البشرية', 'hr.jpg', '916', '60', '', '3', 'في ظل التغييرات والتطور الحالي في الأعمال وفي البيئة الإجتماعية الديناميكية، تعد إدارة الموارد البشرية الفعالة القوة الدافعة وراء نجاح الأعمال والمؤسسات، حيث ان إدراك قدرات ومساهمات الموظفين وقيمهم الفريدة أمر أساسي لبناء مشروع تجاري عظيم. يهدف برنامج دبلوم إدارة الموارة المشرية المعتمد من الكلية البريطانية المركزية إلى إكساب المتدرب الخبرة العملية والمعرفة العلمية للعمل في مجال إدارة الموارد البشرية في مختلف قطاعات الأعمال، يتضمن الدبلوم جميع تخصصات الموارد البشرية بواقع 70 ساعة تدريبية لتمكين المشاركين من الحصول على مناصب كمدراء موارد بشرية معتمدون والمساهمة في صياغة أنظمة إدارة الموارد البشرية التي تمكن المؤسسات من تحقيق أهداف العمل الاستراتيجية وتعزيز الأداء التنظيمي الشامل.\r\nلقد تم تطوير برنامج دبلوم إدارة الموارد البشرية المعتمد لتزويد المتدربين بالمعرفة والمهارات الأساسية ليصبحوا محترفين ناجحين في مجال الموارد البشرية بحيث يغطي مواضيع متنوعة في الموارد البشرية مثل: دور موظفي ومدراء الموارد البشرية في التوظيف، التدريب، تقييم الموظفين وتحفيزهم، إدارة علاقات الموظفين بأرباب العمل، وإدارة التغيير داخل المؤسسة، بالإضافة إلى ذلك، سيتم تعريف المتدربين بالمبادئ والمفاهيم العامة والجوانب القانونية للموارد البشرية.', NULL, NULL),
(22, 'المحاسب الاداري المعتمد\r\nالجزء الأول', 'calcjpg.jpg', '634', '79', '', '3', 'تعتبر شهادة المحاسب الإداري المعتمد CMA الصادرة عن معهد المحاسبين الإداريين في الولايات المتحدة الأمريكية IMA من أهم الشهادات في مجالات الإدارة والمحاسبة، لذلك صُممت دورة المحاسب الإداري المعتمد بجزأيها الأول والثاني لتمكين المشتركين من كافة المواضيع المالية المتعلقة بشركاتهم وأعمالهم المتمثلة في تحليل للبيانات المالية والرقابة المالية ومحاسبة التكاليف وإدارة المخاطر واتخاذ القرارات المالية والتجارية استناداً إلى البيانات المالية.', NULL, NULL),
(23, 'محترف سلاسل الإمداد', 'sel.jpeg', '493 ', '24', '', '3', 'صُممت دورة محترف سلاسل الإمداد لتمكين المشتركين من تحسين أدائهم وتطوير حياتهم المهنية وتعزيز قدرتهم على التنسيق بين كافة الأطراف التي تتعامل معها شركاتهم، مما يسهم في إيصال المنتجات والخدمات للعملاء بأفضل صورة، بالإضافة إلى تحسي عمليات التنسيق ما بين أقسام الشركة المختلفة وتحسين الأداء والوصول إلى أفضل منتج.\r\n\r\nتسهم هذه الدورة في جعل عملية التصنيع المعقدة سهلة بالإضافة الى تخفيض التكاليف، وذلك من خلال تعزيز قدرة المشترك على إدارة الحركة ونقل وتدفق البضائع وتخزين المواد الخام والسلع والمخزون من نقطة البداية من تصنيع وإنتاج المنتج الى نقطة وصول المنتج الى المستهلك في الوقت المناسب بأقل التكاليف', NULL, NULL),
(24, 'المسوق الرقمي المعتمد', 'التسويق-الرقمي.webp', '775 ', '40', '', '3', 'تمكنك هذه الدورة من تطوير مهاراتك في عملية التسويق الرقمي، من خبرة عملية واسعة في تخصصات تحسين محركات البحث، وتحليلات الويب وتسويق المحتوى والتسويق عبر الهاتف المحمول ووسائل التواصل الاجتماعي، بالإضافة إلى رفع مستوى إتقانك للمهارات والمعرفة، من خلال تقديم أحدث مفاهيم التسويق الرقمي باستخدام التطبيقات الخاصة.\r\n\r\n تم إعداد هذه الدورة التدريبية خصيصًا للمهنيين ورجال الأعمال والأفراد الطامحين الذين ينوون توسيع مهاراتهم واكتساب الخبرة في مجال التسويق الرقمي.', NULL, NULL),
(25, 'ماجستير ادارة الأعمال المصغر', 'mba.jpeg', '916 ', '75', '', '3', 'صُمم برنامج Mini MBA بطريقة احترافية ومن خلال مجموعة رائدة من رواد الأعمال المعروفين والمدربين المعتمدين دوليًا في عالم إدارة الأعمال. يهدف البرنامج إلى تزويدك بفهم شامل ومهارات ومعرفة وخبرات تدريبية وخبرة وظيفية في جميع مجالات ووظائف إدارة الأعمال، بالإضافة إلى تمكينك من تطبيق المعرفة المكتسبة في مجالات التخطيط الاستراتيجي والمالي، والإدارة والتسويق والعمليات وسلسلة التوريد والموارد البشرية وإدارة المشاريع، حيث يركز البرنامج على الحاجة إلى ممارسة التطبيق العملي لضمان دراسته من منظور علمي وعملي وأن تصل إلى مرحلة متقدمة من المعرفة والتوعية، في نهاية البرنامج ستحصل على شهادات مهنية معتمدة.\r\n\r\nتم تصميم دورة التخطيط الاستراتيجي لتكون برنامجًا تدريبيًا يهدف إلى توضيح طريقة الإعداد وتنفيذ الخطط الاستراتيجية بكفاءة والتي تعمل من خلالها المؤسسة على تحديد استراتيجيتها أو اتجاهها، واتخاذ القرارات بشأن تخصيص مواردها لمتابعة هذه الاستراتيجية، بالإضافة إلى آليات الرقابة لتوجيه تنفيذها. يعتبر التخطيط الاستراتيجي جانبا هاما من جوانب الإدارة الاستراتيجية التي يقوم بها المخططون الاستراتيجيون.\r\n\r\nمن خلال الدورة ستتمكن من تطوير قدرتك على تحديد نقاط القوة والضعف والفرص والتحديات التي تواجه المنشأة التي تعمل بها، وتحديد الأهداف الرئيسية وتصميم الخطط الاستراتيجية، حيث تساعد عملية التخطيط على ضمان دراسة الخطط بالشكل الكامل وبطريقة مرنة وعملية ومجدية اقتصاديًا، بالإضافة إلى الاستفادة من الأخطاء التي قد تحدث خلال مراحل المشروع في المشاريع المستقبلية واتخاذ القرارات بناءً عليها، كما ستتم مناقشة الاختلاف بين أنواع التخطيط؛ الاستراتيجية والتشغيلية، وكذلك الأساليب التحليلية المختلفة المستخدمة في التخطيط الاستراتيجي مثل تحليل بوتر، وتحليل الفجوة الاستراتيجية، وتحليل بوسطن، وتحليل PESTEL، وتحليل SWOT، بالإضافة إلى تحديد مفهوم KPI، وكيفية مراقبة تنفيذ الخطة الاستراتيجية الموضوعة.', NULL, NULL),
(26, 'الرسم ثلاثي الأبعاد 3D ماكس', '3D.jpeg', '148 ', '24', '', '4', 'مستوى 1\r\nصممت دورة 3Ds MAX  لتمكين المشاركين من استخدام برنامج 3Ds MAX الخاص بإعداد النماذج والتصاميم ثلاثية الأبعاد، لتجسيد التصاميم، وتطوير الألعاب، والرسوم المتحركة بشكل مرئي. سيتمكّن المشاركون خلال هذه الدورة من إنشاء نموذج يشمل أدق التفاصيل وأكثر النماذج تعقيدا ليحقق رؤيتهم بجودة عالية، وذلك من خلال استخدام أدوات عديدة الوظائف إلا أنها سهلة الاستخدام، حيث أن دقة وسهولة هذا البرنامج تساعد أيضا على تصميم النماذج المعمارية، ويمكن استخدامه في العديد من المجالات، حيث يمكن استخدامه أيضا لمحاكاة السيناريوهات الفيزيائية وديناميكيات الحركة للسوائل والغازات والمواد الصلبة، كما سيتمكّن المشارك أيضًا من تهيئة لقطات كاميرا شبيهة بالواقع، مما يضيف مزيدًا من العمق إلى عمله، ويتميز هذا البرنامج بالدقة، حيث تتاح للمشارك إمكانية تحريك الكائنات في اتجاهات مختلفة واستخدام أشكال الشبكة والسطح وذلك بالاعتماد على المراجع الهندسية، كما يتيح هذا البرنامج خيار استخدام نماذج جاهزة من شأنها تسريع إنجاز العمل، إذ لديه واجهة برمجة تطبيقات (API)  مفتوحة للمساعدة على دمج التطبيقات الخارجية.', NULL, NULL),
(27, 'ادوبي افتر افكت', 'ae.jpeg', '198 ', '20', '', '4', 'صُممت دورة أدوبي أفتر افكت لتمكين المشتركين من استخدام برنامج أدوبي آفتر ايفيكت، حيث يتم تعريفهم على أهم الأدوات المستخدمة في البرنامج ونظام التركيب للطبقات والأدوات المساعدة وفلاتر إضاءة الكاميرات وتوزيع الزمن.\r\n\r\nيتم تعريف المشترك خلال الدورة على كيفية إنشاء الرسوم المتحركة والتأثيرات البصرية وتحريك الصور والفيديو ثلاثية وثنائية الأبعاد، بالإضافة إلى عمليات إعداد الموشن جرافيك والخدع السينمائية وتصميم وصناعة الفيديوهات الرقمية والأفلام والعمل مع الطبقات واستخدام الرسوم المتحركة للنصوص وإنشاء عناوين رسوم متحركة ديناميكية.\r\n\r\nتتضمن الدورة تدريباً عملياً، حيث يقوم المشتركين بإعداد مشروع نهائي بتصميم شعار وإخراجه على شكل فيديو لاجتياز الدورة لضمان تحقيق الأهداف المرجوة.', NULL, NULL),
(28, 'الرسم ثلاثي الابعاد 3D ماكس - المستوى 2', '3D.jpeg', '198 ', '24', '', '4', 'صُممت دورة الرسم ثلاثي الأبعادDs Max 3 المستوى الثاني بحيث تشمل مبادئ تصميم الإضاءة الخارجية والداخلية، فسيتعرف المشارك على طرق انتشار الحزم الضوئية وطريقة احتساب الظلال بالمشهد، بالإضافة إلى مقدمة عامة في استخدام المصادر الضوئية  V-Rayواستخدام الكاميرا الخاصة به، كما سيتم تعريف المشارك على المواد الأساسية الخاصة بالـ V-Ray من كروم، وزجاج، وما إلى ذلك .\r\n\r\nفي نهاية هذه الدورة ومن أجل ضمان تحقيق الطلاب لأهداف البرنامج، يتعين على المشترك تقديم مشروع خاص بتصميم حجرة Booth، إضافة إلى الإضاءة المناسبة والكاميرا واختيار المادة المناسبة بالإضافة إلى خلفية بالتصوير بالمدى الديناميكي العالي HDR.\r\n\r\n', NULL, NULL),
(29, 'ادوبي بريميير برو', 'pr.png', '170 ', '24', '', '4', 'تحرير الفيديو هو فن تجميع الفيديو والصوت والصور والعناوين بشكل متسلسل يغطي الأفكار بحيث يعد التحرير العملية الأخيرة في سلسلة إنتاج الفيديو. تم تصميم دورة ادوبي بريميير برو Adobe Premiere Pro CC لتمكين المشاركين من الاستفادة من برنامج ادوبي بريميير برو لمشاريع تحرير الفيديو لوسائل الإعلام الاجتماعية، مواقع الويب، وفيديوهات المنتجات التوضيحية الخاصة بالشركات وغيرها من الأغراض الترويجية أو التعليمية؛ لإيصال الأفكار والرسائل باستخدام أقوى أدوات تحرير مقاطع الصوت والفيديوهات. فتبدأ الدورة بمقدمة عامة لتعريف المشاركين على أنواع مقاطع الفيديو، وكذلك تنسيق الصور ومقاطع الصوت، وبعد ذلك سيتم تغطية التقنيات والأدوات المتقدمة للبرنامج والتي تشمل تقنيات استيراد الأصول، تقنيات التحرير، إنشاء العناوين، التطبيق والعمل مع المؤثرات، إضافة وتحرير المؤثرات الانتقالية، تحليل وتثبيت اللقطات، الكروما، تقنيات التحرير المتقدمة، الحركة، الصوت، والتصدير لأغراض البث، الويب، وسائل الإعلام الاجتماعية والأجهزة النقالة، فهذه الدورة تعد مثاليةً لمن يرغب باحتراف مهمة تحرير الفيديو.', NULL, NULL),
(31, 'سكتش أب', 'skatch.png', '212', '26', '', '4', 'يعتبر برنامج الرسم الهندسي السكتش أب SketchUp من البرامج السهلة والمتميزة التي يسهل تعلمها والإبداع فيها، إن للبرنامج قابلية كبرى في إنتاج رسوم هندسية ثلاثية الأبعاد بالغة الدقة والجودة العالية وكذلك إنتاج رسوم ثنائية الأبعاد بخطوات سهلة وسريعة. وكذلك، إن البرنامج عمليا كغيره من البرامج الهندسية يعتمد بعد تعلمه على مهارات المستخدم وإمكانياته في التخيل النهائي للرسم أو التصميم وبالتالي سوف يكون قادرا على التعرف على آليات وأدوات الرسم المتوفرة في البرنامج حيث يراعي هذا البرنامج عدة تخصصات مثل التصميم الداخلي والمعماري والميكانيك.\r\n\r\nتهدف هذه الدورة إلى تزويد المتدربين بأسس ومبادىء صحيحة في الرسم الهندسي بالإضافة إلى تمكينهم من رسم مخططات ثلاثية الأبعاد بشكل تفصيلي وإضافة التفاصيل المهمة كالأبعاد والتأثيرات الخارجية.', NULL, NULL),
(32, 'ادوبي فوتوشوب', 'ps.jpg', '212', '30', '', '4', 'صممت دورة  Adobe Photoshop  بمستوييها المبتدئ والمتوسط لتمكين المشاركين خطوة بخطوة من استخدام أفضل برنامج للتصميم الجرافيكي، حيث تهدف الدورة إلى تمكينهم من استخدام برنامج Photoshop  لتعريف المشارك بكيفية إنشاء مستند جديد من الصفر إلى الطباعة الرقمية، إضافة إلى تطوير مهارات إنشاء التصاميم البصرية المتنوعة، وإنشاء الصور المتحركة، مع القدرة على إجراء تعديلات بسيطة على مقاطع الفيديو في الإصدارات الحديثة، والتمكّن من تعديل الصور الفوتوغرافية، والتلاعب بالصور والتصميمات بإدخال أو إزالة أجزاء أخرى غير موجودة بالملف الأصلي، كما سيكتسب المشارك مهارة التعامل مع أنظمة القياس، والعمل مع الطبقات وأنماط الطبقات باستخدام أدوات التحديد.\r\n\r\nكما تهدف الدورة إلى إكساب المشاركين مهارات تحرير الصور، ومعالجتها، وتعديل التصوير رقميا بطريقة احترافية، لتوفير حلول مبتكرة من خلال التقنيات والمميزات والأدوات التي يوفرها البرنامج، بحيث يمكّن المستخدم من إنشاء رسومات جديدة ومبتكرة للوسائط المطبوعة والرقميّة.', NULL, NULL),
(33, 'ادوبي إليستريتور', 'Ai.jpg', '148', '26', '', '4', 'صُممت دورة أدوبي إليستريتور Adobe Illustrator CC بمستواها الأول لتمكين المشتركين من استخدام برنامج Adobe Illustrator بشكل أكثر احترافية وسهولة، حيث يتم تعريفهم على كيفية إنشاء مستندات وتخطيطات جديدة من الصفر لأنظمة الطباعة والقراءة الرقمية، بالإضافة إلى تمكينهم من العمل مع المسارات والنقاط والألوان وتصدير الوثائق، والتعامل مع الخطوط.\r\n\r\nسيتمكن المشترك خلال الدورة من تعلم كيفية إنشاء تصاميم لصفحات الويب والهواتف النقالة بصورة واضحة احترافية، وإمكانية إضافة ألوان وإسقاطات مناسبة، واستيراد ملفات متعددة في نفس الوقت، علاوةً عن تعلم كيفية تصميم ناقلات متعددة.', NULL, NULL),
(34, 'التسويق عبر وسائل التواصل الإجتماعي', 'دليلك-إلى-التسويق-عبر-مواقع-التواصل-الاجتماعي.png', '212', '24', '', '4', 'يُعد التسويق عبر مواقع التواصل الاجتماعي من أبرز الوسائل للتسويق في الوقت الحالي، حيث تعتمد عليها الكثير من الشركات والمؤسسات في نشاطهم التجاري، كما أصبحت وسيلةً يتنافس عبرها مقدمي الخدمات وبائعي المنتجات لزيادة المبيعات وجذب العملاء؛ لذا صُممت دورة التسويق عبر وسائل التواصل الاجتماعية SMM لمساعدة المتدربين على الوصول إلى العملاء المستهدفين من خلال شبكات ووسائل التواصل الاجتماعية وشبكة الانترنت، فضلًا عن التفاعل المستمر وتحسين التواصل مع العملاء، وتطوير العلاقة مع الزبائن بشكل كبير، وتوسيع قاعدة العملاء. ستساعدك هذه الدورة التدريبية على معرفة الطرق، وتقنيات، والتكتيكات التي تمكنك من تحسين أدائك التسويقي والترويج لمنتجاتك وخدماتك من خلال استخدام مختلف وسائط ومواقع التواصل الاجتماعي.', NULL, NULL),
(35, 'الأيلتس الأكاديمي\r\nدورة تحضيرية', 'ielts.webp', '254', '50', '', '5', ' \r\n\r\nالآن، يمكنك إجراء اختبار القراءة IELTS بثقة من خلال الدورة التحضيرية ايلتس IELTS -مهارات القراءة التي تمثل دليلاً كاملاً لكل ما يحتاج المشارك إلى معرفته من خلال التعريف باستراتيجيات القراءة العامة التي ستساعده على التعامل مع مختلف أنواع  النصوص التي قد يُصادفها المشارك خلال اختبار IELTS لتنمية قدراته على التركيز على المعلومات الرئيسية والمهمة، باستخدام المهارات الفرعية كالقراءة السريعة. بالإضافة إلى ذلك، تستعرض هذه الدورة أنواع الأسئلة المختلفة وكيفية الإجابة عليها.', NULL, NULL),
(36, 'اللغة الإنجليزية للمبتدئين', 'téléchargement.png', '212', '32', '', '5', 'أساسي أ\r\nتهدف دورات اللغة الإنجليزية العامة إلى تطوير مهارات المشاركين باللغة الإنجليزية سواء أكانوا مبتدئين أو متقدمين، بحيث تتضمن تعليمات خطوة بخطوة وتمارين ومناقشات وفعاليات لجعل عملية التعلم مرنة وممتعة لتمكين المتدربين من تحسين انجليزيتهم وفهم قواعد اللغة وتطبيقها اثناء التحدث. في البداية يتم فحص مستوى اللغة لدى المتدربين لتسجيلهم بالمستوى الذي يناسبهم حيث أن دورات اللغة الإنجليزية العامة تتكون من 12 مستوى تبدأ من المستوى الأساسي أ، المستوى الأساسي ب، المستوى الأول، الثاني، الثالث، ...إلى العاشر.\r\nيغطي برنامج اللغة الإنجليزية للمبتدئين المستويات الأساسية أ و ب لتزويد المشاركين بالأساسات العامة وتعزيز معرفتهم باللغة الإنجليزية وإعدادهم وتأهيلهم للانضمام إلى المستويات العليا بثقة.', NULL, NULL),
(37, 'المحادثة باللغة الإنجليزية', 'How-to-Learn-Spoken-English_.png', '24', '127', '', '5', 'صُممت دورة المحادثة باللغة الإنجليزية لتطوير المهارات اللغوية والإدراكية للمشتركين وزيادة قدرتهم في المحادثة، حيث يتم التركيز خلال الدورة على كيفية عمل الاتصال وتشجيع المشاركين على التفاعل واستخدام اللغة الإنجليزية كلغة حوار من خلال التطرق لمواضيع متنوعة خاصة في القراءة والاستماع والمحادثة، مما يساعد المشترك على تطوير مهارات المحادثة واستخدام اللغة بطلاقة كوسيلة للتخاطب واستخدام القواعد اللغوية المتقدمة وإعدادات اللغة بشكل أسرع دون الحاجة لمساعدة في الترجمة.', NULL, NULL),
(38, 'اللغة الإنجليزية - المستوى الأساسي', 'English-Language-Level-System-704x350.jpg', '212\r\n', '32', '', '5', 'يقدم المستوى الأساسي بمستوييه الأول والثاني للمشتركين كافة أساسيات بنية اللغة الإنجليزية مما يساعدهم على التدرج في فهم القواعد الأساسية ومفردات اللغة وتوظيفها في السياقات العامة.\r\n\r\nيتضمن المستوى الأول تعريفاً شاملاً بضمائر الملكية والمتكلم والعديد من المفردات الهامة وأسماء الدول، كما يتم تدريب المشترك على كيفية إلقاء التحية على الأشخاص والتعريف عن أنفسهم واستخدام أفعال الكينونة Verb to be والأفعال المستخدمة في التعبير عن قدرة الشخص مثل فعل Can، ثم توظيفها في حالات النفي والسؤال.\r\n\r\nيمكن للمشترك من خلال هذه الدورة التعرف على طرق كتابة البريد الإلكتروني والرسائل بطرق أكثر احترافية سواء كانت رسمية أو غير رسمية، بالإضافة إلى التعرف على تصاريف الأفعال المضارعة البسيطة والقدرة على التحدث بطلاقة بلغة خالية من الأخطاء.\r\n\r\nتتضمن الدورة محاور تسهم بشكل كبير في زيادة قدرة الشخص بالتعبير عن نفسه والتحدث عن مهنته ودراسته ووصف مكان سكنه واستخدام أحرف الجر في مكانها الصحيح واستخدام الكلمات التي تعبر عن الاتجاهات.', NULL, NULL),
(39, 'اللغة الإنجليزية - المستوى دون المتوسط', 'p03zh5tk.jpg', '212', '32', '', '5', 'صُمم برنامج اللغة الإنجليزية-المستوى دون المتوسط بمستوييه الثالث والرابع لزيادة قدرة المشترك على استخدام اللغة الإنجليزية ومفرداتها بشكل أدق وأكثر احترافية وذلك من خلال تقديم مجموعة متنوعة من الأنشطة والمواد التعليمية في المستوى الثالث منه.\r\n\r\nسيتمكن المشترك في المستوى الرابع من التعرف على مهارات الاشتقاق والمفردات من خلال الدخول في مجموعات متنوعة من فقرات القراءة والاستماع التي تتضمن حوارات بمفردات جديدة ومتنوعة تسهم بشكل كبير في تعزيز وزيادة مضمون المفردات لدى المشترك بعد تركيزه على فهمها وحفظها وممارستها في حياته اليومية', NULL, NULL),
(40, 'اللغة الإنجليزية - المستوى المتوسط', 'istockphoto-1288019626-612x612.jpg', '212', '32', '', '5', 'صمم برنامج اللغة الإنجليزية-المستوى المتوسط بمستوييه الخامس والسادس لتمكين المشتركين من استخدام المفردات ومهارات القواعد والكتابة والقراءة، حيث يتم خلال الدورة تقديم مجموعة واسعة ومتنوعة من التمارين التفاعلية التي تركز على التعبيرات وأشباه الجمل والفرق بين اللغة الإنجليزية الرسمية وغير الرسمية.\r\n\r\nتتضمن الدورة أنشطة تسهم بشكل كبير في توفير معرفة شاملة لدى الطلاب حول الامتحانات الدولية مثل TOEFL وIELTS، الأمر الذي يجعل هذه الدورة فرصة كبيرة لتطوير مهارات اللغة الإنجليزية لدى المشترك وزيادة قدرته في التعبير عن نفسه بشكل جيد باستخدام تعابير دقيقة وفعالة', NULL, NULL),
(41, 'أنواع التفكير والتركيز على التفكير الإبداعي', '6-factors-human-thinking-skills.jpg', '282 ', '35', '', '6', 'صُممت دورة أنواع التفكير والتركيز على التفكير الإبداعي لتعريف المشتركين على ما يسمى بالتفكير الإبداعي في التدريس والذي يساعد المعلمين على ابتكار أفكار جديدة في التعليم تسهم في تنمية أفكار الطلاب وإيصال المعلومة لهم بشكل إبداعي.\r\n\r\nتتضمن الدورة محاور تساهم في تعريف المشترك على دور التكنولوجيا في تنمية التفكير الإبداعي والتفكير المفتوح لدى المعلم والطالب، كما تسهم في تمكين المشترك من استراتيجيات التعلم من حلال حل المشكلات.\r\n\r\nتسهم الدورة في تعريف المشترك على مواصفات المدرسة المنشودة حالياً في ضوء التطورات التكنولوجية التي ساهمت في تطوير عملية التعلم والتعليم، والتعرف على كيفية التغيير وإدارة التغيير في المدرسة، كما يمكن للمشترك معرفة كيفية التعلم المعتمد على المدرسة البنائية.\r\n\r\n', NULL, NULL),
(42, 'المعلم الداعم', 'BLD_P04_05102021_ED1-1.jpg', '282', '40', '', '6', 'صُممت دورة المعلم الداعم لتطوير مهارات المعلم ليكون قادراً على تحديد احتياجات الطلاب والعملية التعليمية وتقييم استخدام أدوات التكنولوجيا في التعليم وتقديم الدعم المناسب للمعلمين الآخرين بناءً على احتياجاتهم.\r\n\r\nتهتم هذه الدورة بتمكين المشتركين من مهارات القيادة وبناء الفريق المناسب وتعلم مهارات الاتصال والتواصل بين أفراد الفريق الواحد، ومهارات العرض والتقديم الجيد، بالإضافة إلى تعريف المشتركين كيفية إعطاء تغذية راجعة وتلقيها من الآخرين.\r\n\r\nتتضمن الدورة محاور تساهم في تمكين المشتركين من مهارات التدريب وتصميم المحتوى التدريبي المناسب الذي يساهم في تقديم عملية تعليمية متقدمة خالية من الأخطاء.', NULL, NULL),
(43, 'البيئة التعليمية', 'التعليم الالكتروني.webp', '212', '25', '', '6', 'تهدف دورة البيئة التعليمية إلى تمكين المتدربين من أسس مهنة التعليم ومكوناتها وكيفية التعامل مع الغرفة الصفية وإدارتها وجاهياً وعن بعد، كما يمكن للمشترك من خلال الدورة معرفة كيفية إيجاد بيئة تعلم آمنة ومحفزة للمتدربين وكيفية غرس السلوكيات الجيدة في نفوس الطلبة، بالإضافة إلى التعرف على المشكلة الأبرز لديهم وهي التأخر الدراسي وكيفية التعامل معها والارتكاز على أسس نظرية التعلم البنائية في تدريس الطلبة لمساعدة المعلمين على جعل التعلم فعالاً.\r\n\r\nتتضمن الدورة أهم الأدوات التكنولوجية التي تساعد المعلمين على الاتصال والتواصل معاً ثم الاستعانة بهذه الأدوات والتطبيقات التي تساعدهم في ضبط الغرفة الصفية وإدارتها بشكل فعال مما يُمكنهم من تحقيق الأهداف التربوية المنشودة.\r\n\r\nستتناول دورة البيئة التعليمية الامكانات غير المحدودة لتكنولوجيا المعلومات والاتصالات في التعليم، وأن التوظيف الفعال لهذه الوسائل يعني إحداث تغيير في أساليب التعليم والتعلم وفي دور الطالب والمعلم وفي المحتوى الدراسي أيضا، كما سيتعرف المشترك من الدورة على أهم الاستخدامات المتعددة لتكنولوجيا المعلومات والاتصالات في التعليم بحيث يمكن للمعلم تحديد المناسب منها لاستخدامه في غرفته الصفية.\r\n\r\nيمكن للمعلم من خلال الدورة تطوير مهارات عملية في تصميم وتقديم أنشطة صفية مرتبطة بتكنولوجيا المعلومات والاتصالات، وتنمية مهارة التأمل لدى المعلم.', NULL, NULL),
(44, 'التخطيط للتدريس', 'top-5-planning-information.jpg', '282 ', '35', '', '6', 'تهدف دورة التخطيط للتدريس إلى تعريف المشتركين على مواصفات خطة الدرس ومكوناتها وسمات المتعلمين وتوظيف تلك المعرفة في النشاط اليومي للمعلم وجاهياً وعن بعد والتخطيط الفعال لمخاطبة تلك السمات، حيث يتم التعرف على مفهوم وصياغة الأهداف التعليمية المعرفية والسلوكية والوجدانية ومستويات كل منها.\r\n\r\nتتطرق الدورة إلى أهم استراتيجيات التدريس الحديثة واستخدامات كل منها مع استراتيجيات تنمية التفكير لدى الطلبة، كما سيتعرف المشترك على دور التكنولوجيا في مراعاة الفروق الفردية وتطبيق بعض الأدوات المناسبة التي لها دور في التخطيط للتدريس الوجاهي وعن بعد.', NULL, NULL),
(45, 'اوتوكاد\r\nللرسم الميكانيكي', '791fbe9c2c52b2dedefd67242a603e12.jpg', '140', '24', '', '7', 'صممت دورة أوتوكاد للرسم الميكانيكي لتمكين المشاركين من استخدام برنامج الأوتوكاد والالمام بالأدوات والتقنيات لإنتاج رسومات وتصاميم هندسية في العديد من المجالات والمهن والصناعات، بالاضافة لكيفية إنشاء رسومات تفصيلية ثنائية الأبعاد والتي تتضمن بشكل رئيسي المخططات الميكانيكية.\r\n\r\nستتضمن الدورة تطبيقات عملية ومناقشات لتعزيز الجانب العملي لدى المشاركين بحيث يتعين على المشاركين إعداد مشروع نهائي لاجتياز الدورة وضمان تحقيقهم للأهداف المرجوة منها.', NULL, NULL),
(46, 'اوتوكاد\r\nللرسم الكهربائي', 'maxresdefault.jpg', '140', '24', '', '7', 'صممت دورة أوتوكاد للرسم الكهربائي لتمكين المشاركين من استخدام برنامج الأوتوكاد والالمام بالأدوات والتقنيات لإنتاج رسومات وتصاميم هندسية في العديد من المجالات والمهن والصناعات، بالاضافة لكيفية إنشاء رسومات تفصيلية ثنائية الأبعاد والتي تتضمن بشكل رئيسي المخططات الكهربائية.\r\n\r\nستتضمن الدورة تطبيقات عملية ومناقشات لتعزيز الجانب العملي لدى المشاركين بحيث يتعين على المشاركين إعداد مشروع نهائي لاجتياز الدورة وضمان تحقيقهم للأهداف المرجوة منها.\r\n\r\n', NULL, NULL),
(47, 'صيانة سيارات الهايبرد والكهرباء', 'صيانة_سيارات.jpg', '423', '60', '', '7', 'استحدثت دورة صيانة سيارات الهايبرد و الكهرباء لإكساب المشاركين المهارات اللازمة لصيانة المركبات الهجينة و الكهربائية و تعريفهم بالمفاهيم الخاصة بالمركبات والتطبيقات المتعلقة بالأنظمة ذات الجهد المرتفع مثل: أنواع البطاريات والمحركات ووحدات التحكم بالطاقة التي تربط أجزاء النظام ببعضها البعض، كما سيتم إكساب المشاركين المهارات العملية والتطبيقية في مختبرات ومشاغل فنية متخصصة.', NULL, NULL),
(48, 'ريفيت\r\nالهندسة الكهربائية', 'ما_هي_هندسة_الكهرباء.jpg', '240', '24', '', '7', 'صممت دورة ريفيت الهندسة الكهربائية لتمكّنك من استخدام الميزات والأدوات المتقدمة الخاصة بالبرنامج والمتعلقة بأعمال هندسة الكهرباء التي يستخدمها المهندسون كجزء من تصميم وتحليل وتوثيق مشاريع أنظمة المباني، كما تهدف الدورة الى رفع كفاءة المشاركين للمستوى الاحترافي من خلال تطبيق مشاريع وممارسات عملية حقيقية موجودة على ارض الواقع.\r\n\r\nيعد برنامج ريفيت البرنامج الأحدث لتصميم ونمذجة معلومات البناء BIM لمهندسي الأنظمة الكهربائية.', NULL, NULL),
(49, 'تصميم الأعمال الكهربائية', 'الهندسة_الكهربائية_ومستقبلها.jpg', '599', '60', '', '7', 'تم تصميم دورة الأعمال الكهربائية لتزويد المشاركين بأساسيات وطرق تصميم أعمال الكهرباء للأبنية عن طريق تعريف وتوعية المشاركين بالأساسيات والمهارات المختلفة لتصميم الأعمال الكهربائية بحيث ترتكز الدورة على تعلم آلية حساب الأحمال الكهربائية التمديدات الكهربائية بكافة مجالاتها،  تصميم وتركيب لوحات التوزيع، أنواع الكوابل وحساب مساحة مقطعها، وكذلك التصميم باستخدام العديد من برامج الحاسوب. بالإضافة الى ذلك،  ستؤهل هذه الدورة المشاركين من تصميم الأعمال الكهربائية لمشاريعهم الخاصة.', NULL, NULL),
(50, 'تصميم الأعمال الميكانيكية', 'مراحل-الأعمال-الميكانيكية-في-التشييد-والبناء.jpeg', '599', '70', '', '7', 'صممت دورة تصميم الأعمال الميكانيكية لتأهيل المشاركين وخصوصاً المهندسين الميكانيكيين للعمل في مجال تخصصهم عن طريق تزويدهم بالمعرفة اللازمة للعمل في مجال المقاولات،  بحيث تتناول هذه الدورة الشاملة جميع المواضيع المتعلقة في الأعمال الميكانيكية الخاصة بكل من المباني السكنية وكذلك التجارية، مثل أنظمة التكييف والتبريد، مكافحة الحريق، الهواء المضغوط، غاز البترول، والعديد من المواضيع الأخرى.', NULL, NULL),
(51, 'ريفيت\r\nالهندسة الميكانيكية', 'نبذة_عن_الهندسة_الميكانيكية.jpg', '240', '24', '', '7', 'صممت دورة ريفيت الهندسة الميكانيكية لتمكّنك من استخدام الميزات والأدوات المتقدمة الخاصة بالبرنامج والمتعلقة بأعمال هندسة الميكانيك والسباكة التي يستخدمها المهندسون كجزء من تصميم وتحليل وتوثيق مشاريع أنظمة المباني، كما تهدف الدورة الى رفع كفاءة المشاركين للمستوى الاحترافي من خلال تطبيق مشاريع وممارسات عملية حقيقية موجودة على ارض الواقع.\r\n\r\nيعد برنامج ريفيت البرنامج الأحدث لتصميم ونمذجة معلومات البناء BIM لمهندسي الأنظمة الميكانيكية.', NULL, NULL),
(52, 'تقنية سيارات الهايبرد', 'screen_shot_2019_02_18_at_104526_am_1024x640.png', '539 ', '20', '', '7', 'النظام الهجين هو موجة من المستقبل، بحيث أدى النمو السكاني السريع والتنمية الاقتصادية في العقود الأخيرة إلى زيادة حادة في استهلاك الوقود على مستوى العالم وأدى إلى زيادة التلوث في الجو، وهذه العوامل جميعها أدت إلى الحاجة الماسة لوجود مادة تدريبية تقوم بشرح النظام بشكل كامل ومعرفة أجزاءه ومعرفة أهميته وكيفية عمل صيانة له.\r\n\r\nتستخدم المركبة الهجينة نوعين منفصلين أو أكثر من الطاقة، مثل محرك الاحتراق الداخلي الذي يعمل على تشغيل مولد كهربائي يعمل على تشغيل المحرك الكهربائي، على سبيل المثال، في القطارات الهجينة، تقوم محركات الديزل بتشغيل المولد الكهربائي الذي يعمل على تشغيل المحرك الكهربائي. يهدف مساق السيارات الهايبرد إلى إكساب المتدربين المعرفة الكافية في تصنيفات السيارات الهجينة، أجزاء ومكونات السيارات الهجينة، ومميزات وعيوب السيارات الهجينة.', NULL, NULL),
(53, 'كهرباء السيارات الحديثة', 'كيف_أتعلم_كهرباء_السيارات؟.jpeg', '599 ', '20', '', '7', 'تم تصميم دورة كهرباء السيارات الحديثة لاكساب المشاركين الأساسيات الكهربائية والإلكترونية  الخاصة بالسيارات الحديثة وحساباتها بلغة سهلة ومبسطة، كما سيتم تعريفهم بأجهزة قياس وحماية الدوائر الكهربائية وأنواعها والتركيب الرئيسي لها وطرق فحصها.\r\n\r\nكما تهدف الدورة إلى اكساب المشاركين المعرفة التامة بأنواع البطاريات وتركيبها ومبدأ عملها والعوامل التي تؤثر بها وطرق فحصها، بالاضافة إلى تعريفهم على بادئ الحركة والأجزاء الرئيسية لمنظومة بدء الحركة، وتمكنهم من قراءة المخططات الكهربائية لبادئ الحركة واختبارات منظومة الحركة في حال حصول أعطال معينة.', NULL, NULL),
(54, 'محركات الإحتراق الداخلي', '2014202003073365.png', '240', '16', '', '7', 'صممت دورة محركات الاحتراق الداخلي لاكساب المشاركين  المفاهيم الأساسية ومبدأ عمل المحرك، معرفة جميع أجزائه ووظائفها داخل المحرك، ومعرفة بعض الأنظمة المساعدة للمحرك .\r\n\r\nكما تهدف الدورة على التعرف اكساب المشاركين المهارات  التقنية في فك وتركيب أجزاء المحرك، وكذلك تعريفهم على نظام التبريد وأجزاءه وأهم أعطال نظام التبريد.', NULL, NULL),
(55, 'الرخصة الدولية في قيادة الحاسوب', 'صورة_التخصص_ICDL_أفقي.jpg', '127', '54', '', '8', '\r\nصُممت دورة الرخصة الدولية لقيادة الحاسوب لتطوير مهارات المشاركين وتعزيز قدرتهم على التعامل مع أجهزة الحاسوب وتطبيقاتها العامة، حيث يتم تزويد المشترك بالمهارات والكفاءات اللازمة لاستخدام جهاز الحاسوب وتطبيقاته في المستوى المطلوب لأي عمل، وذلك من خلال تقديم أمثلة عملية للتنفيذ تسهم في تعزيز قدرات المشترك بشكل أكبر، كما توفر الدورة فرصة كبيرة لتطوير كفاءة المشترك للتطوير الوظيفي في المستقبل أو التطوير المهني المستمر.\r\n\r\nتعد هذه الدورة من أهم الفرص لدى المشتركين لتعزيز سيرتهم الذاتية ومساعدتهم في الحصول على الوظائف بشكل أسرع، حيث تسهم الدورة في تطوير مهارات المشترك الرقمية بما يتوافق مع معايير التدريب العالمية وفقاً لمناهج ECDL الرسمية التي تعد الجهة المانحة للشهادات الخاصة بالبرامج الدولية الرائدة لاعتماد مهارات الحاسوب لتدريب وعقد امتحانات دورة ICDL.', NULL, NULL),
(56, 'خدمات الحركة الجوية', 'téléchargement.jpeg', '247', '50', '', '9', 'تم تصميم دورة الخدمات الجوية لتزويد المشاركين بالمهارات اللازمة لتمكينهم من قيادة وتوفير التوجيه في جميع جوانب الأنشطة والخدمات المقدمة أثناء الطيران والاقلاع، عن طريق تزويدهم بأهم معايير وإجراءات الصناعة الموصى بها، بالإضافة إلى إنشاء ودعم وإدارة مجموعات وفرق العمل.', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `desccourse`
--

CREATE TABLE `desccourse` (
  `id` int(11) NOT NULL,
  `idrecord` varchar(255) NOT NULL,
  `desc1` varchar(1000) NOT NULL,
  `desc2` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `desccourse`
--

INSERT INTO `desccourse` (`id`, `idrecord`, `desc1`, `desc2`) VALUES
(1, '1', '\r\nفهم وتنفيذ أساسيات البرمجة باستخدام بايثون.', 'Introduction'),
(2, '1', '\r\nإنشاء قواعد البيانات والتعامل معها باستخدام .SQL', 'Programming using Python'),
(3, '1', 'فهم وإعداد البيانات.', 'Data using SQL'),
(4, '1', 'تصور البيانات.', 'Data Pre-processing'),
(5, '1', 'إنشاء أنواع مختلفة من نماذج التعلم الآلي.', 'Data Visualization'),
(6, '1', 'نشاء أنواع مختلفة من الشبكات العصبية للتعلم العميق.', 'Machine Learning'),
(7, '1', 'استخدام السحابة على أسس الذكاء الاصطناعي', 'Deep Learning'),
(8, '1', 'استخدام السحابة على أسس الذكاء الاصطناعي', 'Deep Learning'),
(9, '1', 'استخدام السحابة على أسس الذكاء الاصطناعي', 'Deep Learning'),
(10, '1', 'نشر نماذج التعلم الآلي والعميق.', 'Cloud Computing'),
(11, '1', '', 'Model Deployment'),
(12, '1', '', 'Conclusion'),
(13, '2', 'العمل على تطوير مايكروسوفت ASP.Net', 'introduction'),
(14, '2', 'الحصول على التقنيات والمهارات اللازمة في مايكروسوفت لإنشاء مواقع ويب ديناميكية من البداية بأفضل أداء وأفضل مظهر وأسلوب.', 'Home'),
(15, '2', 'إلمام المتدربين في عملية تطوير الويب بشكل عام.', 'Overview'),
(16, '2', 'العمل على تطوير تطبيقات الويب ASP.Net core MVC', 'Environment'),
(17, '2', 'تعلم التقنيات المتقدمة والمهارات في مايكروسوفت لإنشاء مواقع ويب ديناميكية من البداية بأفضل أداء وأفضل مظهر وأسلوب.', 'Program Structure'),
(18, '2', 'تزويد المتدربين بنظرة عامة على تقنيات وخدمات السحابة.', 'Basic Syntax'),
(19, '2', '\r\nتعريف المتدربين على استضافة واستخدام خدمات الويب ASP.NET', 'Data Types'),
(20, '2', 'تعلم كيفية نشر تطبيقات الويب على نوافذ Azure.', 'Type Conversion'),
(21, '2', '', 'Variables'),
(22, '2', '', 'Constants'),
(23, '2', '', 'Operators'),
(24, '2', '', 'Decision Making'),
(25, '2', '', 'Loops'),
(26, '2', '', 'Encapsulation'),
(27, '2', '', 'Nullables'),
(28, '2', '', 'Arrays'),
(29, '2', '', 'Strings'),
(30, '2', '', 'Structure'),
(31, '2', '', 'Enums'),
(32, '2', '', 'Classes'),
(33, '2', '', 'Inheritance'),
(34, '2', '', 'Polymorphism'),
(35, '2', '', 'Operator Overloading'),
(36, '2', '', 'Interfaces'),
(37, '2', '', 'Namespaces'),
(38, '2', '', 'Preprocessor Directives'),
(39, '2', '', 'Regular Expressions'),
(40, '2', '', 'Exception Handling\r\n'),
(41, '2', '', 'File I/O'),
(42, '2', '', 'Conclusion'),
(43, '2', '', ''),
(44, '5', 'فهم واستخدام لغة البرمجة Dart', 'Introduction'),
(45, '5', '\r\nتنفيذ مفاهيم OOP باستخدام Dart', 'Introduction To Flutter'),
(46, '5', 'إنشاء تطبيقات Android و IOS', 'Installing Visual Studio Code and And Android Studio'),
(47, '5', 'استخدام أنواعًا مختلفة من الأدوات', 'Installing Dart SDK And Flutter SDK And Dart Plugin'),
(48, '5', 'تنفيذ تطبيقات الوسائط', 'Building simple app'),
(49, '5', 'حفظ بيانات التطبيق محليًا', 'Understanding the structure of a Flutter Project'),
(50, '5', 'إنشاء تطبيق دردشة لكل من Android و IOS', 'Introducing Widget and roll Flutter app , Stateless and Stateful'),
(51, '5', '', 'Material and Scaffold widget'),
(52, '5', '', 'Explaining Body , Home , AppBar and Floating Action Button'),
(53, '5', '', 'More And Common Widgets'),
(54, '5', '', 'Hot Reload and Hot Restart'),
(55, '5', '', 'Images (Assets , network)'),
(56, '5', '', 'Inkwell and Gestures detector'),
(57, '5', '', 'Navigating flutter'),
(58, '5', '', 'Navigator and routes And Pop'),
(59, '5', '', 'Passing data'),
(60, '5', '', 'Text Field And Handling User Input'),
(61, '5', '', 'ThemeData'),
(62, '5', '', 'Screen Layout'),
(63, '5', '', 'Font Family And Custom Font'),
(64, '5', '', 'Asynchronous Functions'),
(65, '5', '', 'Shared Preferance'),
(66, '5', '', 'Conclusion'),
(67, '6', 'كيفية وصف تصنيفات البيانات المتخصصة على Azure', 'Identity and Access'),
(68, '6', 'إدارة هويات Azure والوصول إليها', 'Platform Protection'),
(69, '6', 'تحديد آليات حماية بيانات Azure\r\n', 'Security Operations'),
(70, '6', '\r\nتأمين البيانات والتطبيقات على Azure', 'Data and applications'),
(71, '6', '\r\nوصف خدمات وميزات أمان Azure', ''),
(72, '6', '\r\nتأمين بروتوكولات الإنترنت وتنفيذها على Azure', ''),
(73, '7', 'تعلم كيفية تنزيل وتخزين الوظائف المتاحة في ويندوز سيرفر 2016.', 'Course 20740: Installation, Storage, and Compute with Windows Server 2016'),
(74, '7', '\r\nتعلم كيفية تثبيت خوادم ويندوز، والعمل على تنفيذ المهام الخاصة بحماية ومراقبة البيئات الخاصة بالخوادم ومراقبتها.', 'Course 20741: Networking with Windows Server 2016'),
(75, '7', '\r\nتعلم المميزات والوظائف الخاصة بالشبكات والمتوفرة في ويندوز سيرفر 2016', 'Course 20742: Identity with Windows Server 2016'),
(76, '7', 'تعلم كيفية تطبيق أنظمة DNS, DHCP, وIPAM ، وكذلك تنفيذ اتصال الشبكة وحلول الوصول عن بعد وكذلك حلول الشبكة الموزعة، والقيام بإنشاء البنية الأساسية المتقدمة للشبكة.', ''),
(77, '7', 'تعلم كيفية إدارة الهويات في ويندوز سيرفر 2016.', ''),
(78, '7', 'تعلم كيفية تنزيل وتكوين خدمات Active Directory (AD DS) ، وكذلك إدارة وصيانةAD D ، إنشاء وإدارة Group Policy, بالإضافة الى تنفيذ خدمات (AD CS) وتطبيق حلول الوصول.', ''),
(83, '8', '\r\nالإلمام بعلم التشفير', 'Introduction'),
(84, '8', '\r\nالإلمام بمصطلحات التشفير', 'Introduction to cipher terminology'),
(85, '8', 'القدرة على تشفير النصوص', 'Monalphabetic'),
(86, '8', 'الإلمام بعلم كسر التشفير', 'Cryptanalysis'),
(87, '8', 'معرفة طرق التشفير القديمة', 'Historical progression'),
(88, '8', 'معرفة طرق التشفير الحديثة', 'Significant Ciphers'),
(89, '8', '', 'Modern Ciphers'),
(90, '8', '', 'Conclusion'),
(93, '9', 'Enable participants to secure identities with Azure Active Directory, and implement users and groups.', 'Module 01 – Identity'),
(94, '9', 'Introduce participants to how to manage your subscriptions and accounts, implement Azure policies, and use Role-Based access control.', 'Module 02 – Governance and Compliance'),
(95, '9', 'Introduce participants to the tools an Azure Administrator uses to manage their infrastructure, including Azure Portal, Cloud Shell, Azure PowerShell, CLI, and Resource Manager Templates.', 'Module 03 – Azure Administration'),
(96, '9', 'Introduce participants to the basic virtual networking concepts like virtual networks and subnetting, IP addressing, network security groups, Azure Firewall, and Azure DNS', 'Module 04 – Virtual Networking'),
(97, '9', 'Introduce participants to intersite connectivity features including VNet Peering, Virtual Network Gateways, and Site-to-Site Connections.', 'Module 05 – Intersite Connectivity'),
(98, '9', 'Introduce participants to network traffic strategies including network routing and service endpoints, Azure Load Balancer, Azure Application Gateway, and Traffic Manager.', 'Module 06 – Network Traffic Management'),
(99, '9', 'Introduce participants to basic storage features including storage accounts, blob storage, Azure files and File Sync, storage security, and storage tools.', 'Module 07 – Azure Storage'),
(100, '9', 'Introduce participants to Azure virtual machines including planning, creating, availability and extensions.', 'Module 08 – Azure Virtual Machines'),
(101, '9', 'Introduce participants to administer serverless computing features like Azure App Service, Azure Container Instances, and Kubernetes.', 'Module 09 - Serverless Computing'),
(102, '9', 'Enable participants to backing up files and folders, and virtual machine backups.', 'Module 10 – Data Protection'),
(103, '9', 'Enable participants to monitoring your Azure infrastructure including Azure Monitor, alerting, and log analytics.', 'Module 11 – Monitoring'),
(104, '10', 'تحديد التهديدات الأمنية لشبكات الحاسوب.', 'Introduction'),
(105, '10', '\r\nتقوية الأنظمة والخدمات الداخلية بالإضافة إلى أجهزة وخدمات التوصيل في الشبكة.', 'Threats'),
(106, '10', 'ضمان أمن الاتصالات في الشبكة.', 'Attacks'),
(107, '10', 'إدارة البنية التحتية للتعاملات التجارية الآمنة.', 'Threat actor types and attributes'),
(108, '10', 'تعلم كيفية فرض سياسة لأمان الحواسيب والشبكة في المنظمة.', 'Penetration testing concepts'),
(109, '10', 'التعرف على مراقبة البنية التحتية الأمنية', 'The impact associated with types of vulnerabilities'),
(110, '10', '', 'Technologies and Tools'),
(111, '10', '', 'Software tools to assess security'),
(112, '10', '', 'Troubleshoot common security issues'),
(113, '10', '', 'Architecture and Design'),
(114, '10', '', 'The importance of secure staging deployment concepts'),
(115, '10', '', 'The security implications of embedded systems'),
(116, '10', '', 'Secure application development and deployment concepts'),
(117, '10', '', 'Cloud and virtualization concepts'),
(118, '10', '', 'How resiliency and automation strategies reduce risk'),
(119, '10', '', 'The importance of physical security controls'),
(120, '10', '', 'Identity and Access Management'),
(121, '10', '', 'Install and configure identity and access services'),
(122, '10', '', 'Risk Management'),
(123, '10', '', 'Risk management processes and concepts'),
(124, '10', '', 'Basic concepts of forensics'),
(125, '10', '', 'Disaster recovery and continuity of operation concepts'),
(126, '10', '', 'Data security and privacy practices\r\n'),
(127, '10', '', 'Cryptography algorithms'),
(128, '10', '', 'Conclusion'),
(129, '11', 'تمكين المشاركين من تثبيت وترقية الأجهزة من فئة الخادم', 'الخوادم ومكوناتها'),
(130, '11', '\r\nتمكين المشاركين من تثبيت وتكوين خادم NOS وبرامج التطبيقات', 'IDE ، SCSI وتخزين الخادم'),
(131, '11', '\r\nتمكين المشاركين من تكوين مصفوفات RAID', 'خادم التثبيت والتكوين'),
(132, '11', 'تمكين المشاركين من استخدام أدوات الإدارة والرصد', 'ترقية الخادم'),
(133, '11', '\r\nتمكين المشاركين من إنشاء خطط التعافي من الكوارث', ' التعافي من الكوارث والنسخ الاحتياطي للخادم'),
(134, '11', 'تمكين المشاركين من استكشاف مشكلات الأجهزة والتخزين والشبكات والبرامج', 'الصيانة والبيئة'),
(135, '11', '', 'خوادم استكشاف الأخطاء وإصلاحها'),
(136, '12', 'وضيح نموذج وتصميم الشبكة الهرمية باستخدام طبقات المستخدمين والتوزيع والطبقات الأساسية', 'Introduction'),
(137, '12\r\n\r\n', 'مقارنة نماذج نقل البيانات على الموزع و الموجه', 'Ccnp path'),
(138, '12', 'استكشاف أخطاء اتصال الطبقة الثانية وإصلاحها باستخدام الشبكات الوهمية', 'Architecture'),
(139, '12', '\r\nتنفيذ اكثر من طريق احتياطي في الموزعات', 'Virtualization'),
(140, '12', 'استكشاف الاخطاء في جمع المخارج على الموزعات', 'Conclusion'),
(141, '12', '\r\nمعلومات متقدمة عن بروتوكول توجيه المسار EIGRP من شركة سيسكو', ''),
(142, '12', 'معلومات متقدمة عن بروتوكول توجيه المسار OSPF', ''),
(143, '12', 'معلومات متقدمة عن بروتوكول توجيه المسار BGP\r\n', ''),
(144, '12', 'تطبيقات على بروتوكولات الموجه الوهمية', ''),
(145, '12', 'تطبيقات على تحويل عناوين الشبكات من الخاصة الى العامة', ''),
(146, '12', '\r\nوصف التكنولوجيا الوهمية في الموزعات و الموجهات', ''),
(147, '12', '\r\nتطبيقات على الشبكات الخاصة المحمية بانواعها', ''),
(148, '12', '\r\nوصف انواع الانتينات و خصائصها', ''),
(149, '12', '\r\nوصف انواع تطبيقات الشبكات اللاسلكية بوجود متحكم', ''),
(150, '12', '\r\nوصف دمج الشبكات اللاسلكية مع خدمات تحديد المكان', ''),
(151, '12', 'وصف كيفية تناقل البيانات ما بين المتحكم و الاجهزة اللاسلكية الاخرى', ''),
(152, '12', '\r\nتطبيقات على انواع بروتوكولات التشفير في الشبكات اللاسلكية', ''),
(153, '12', '\r\nاستكشاف الاخطاء في الشبكات اللاسلكية باستخدام برامج متنوعة', ''),
(154, '12', 'ستكشاف الاخطاء في بروتوكولات الوقت و دعم البيانات عن الاجهزة من خلال برامج سيسكو', ''),
(155, '12', '\r\nاستكشاف الاخطاء داخل الاجهزة من خلال افضل الامثلة لكيفية معرفتها\r\n', ''),
(156, '12', 'منع جميع انواع البيانات و سماحها و تشفيرها داخل الاجهزة', ''),
(157, '12', '\r\nتطبيق بروتوكول طلب طريقة لتاكيد الهوية للشخص و ماذا يمكنه عمله و تسجيل كل ما يقوم به', ''),
(158, '12', 'بيان تطبيقات الحماية المعمول بها داخل اجهزة سيسكو بانواعها', ''),
(159, '12', '\r\nتطبيق التطورات الجديدة من سيسكو في عالم التطبيقات على السحابة وكيفية مراقبة الاجهزة من خلال الاانترنت', ''),
(160, '12', '\r\nبيان عالم الاجهزة الوهمية على الانترنت من خلال تطبيق الشبكات الوهمية الجديدة', ''),
(161, '13', 'تعلم القضايا الرئيسية التي تهدد وتؤثر على أمن المعلومات، إدارة الحوادث، واختبارات الاختراق.', 'Introduction to Ethical Hacking'),
(162, '13', 'تعلم أنواع البصمات المختلفة، أدوات البصمات، والتدابير المضادة.\r\n', 'Footprinting and Reconnaissance'),
(163, '13', 'تعلم تقنيات مسح الشبكات والإجراءات المضادة.', 'Scanning Networks Enumeration'),
(164, '13', 'تعلم تقنيات التعداد والإجراءات المضادة.', 'Vulnerability Analysis'),
(165, '13', 'تعلم منهجية اختراق الأنظمة، إخفاء المعلومات، هجمات إخفاء الأخطاء، وتغطية المسارات.', 'System Hacking'),
(166, '13', '\r\nتعلم الأنواع المختلفة لشيفرة حصان الطروادة, تحليلها, والإجراءات المضادة.', 'Malware Threats'),
(167, '13', 'تعلم تحليل الفيروسات ودودة الكمبيوتر، وكذلك إجراء تحليل البرامج الضارة والتدابير المضادة.', 'Sniffing'),
(168, '13', '\r\nتعلم تقنيات حزم البيانات المارة بالشبكات وكيفية حمايتها.', 'Social Engineering'),
(169, '13', 'تعلم تقنيات الهندسة الاجتماعية، تحديد السرقة، والهندسة الاجتماعية المضادة.', 'Denial of Service'),
(170, '13', 'تعلم تقنيات هجوم DoS / DDoS، botnets، وأدوات الهجوم DDoS، والإجراءات المضادة.', 'Evading IDS, Firewalls, and Honeypot'),
(171, '13', 'تعلم تقنيات الاختطاف والتدابير المضادة.', 'Web Attacks'),
(172, '13', 'تعلم الأنواع المختلفة لهجمات خادم الويب، منهجية الهجوم، والتدابير المضادة.', 'Hacking Wireless Networks'),
(173, '13', 'تعلم الأنواع المختلفة لهجمات تطبيقات الويب، منهجية قرصنة تطبيقات الويب، والتدابير المضادة.', 'Hacking Mobile Platforms'),
(174, '13', 'تعلم هجمات حقن SQL وأدوات الكشف عنها.', 'IOT Hacking and OT hacking'),
(175, '13', 'تعلم التشفير اللاسلكي، منهجية القرصنة اللاسلكية، أدوات القرصنة اللاسلكية، وأدوات أمن Wi-Fi.', 'Cloud Computing'),
(176, '13', 'تعلم الهجوم على الأجهزة المحمولة ، نقاط ضعف نظام التشغيل الآندرويد، والمبادئ التوجيهية لأمن الأجهزة المحمولة.', 'Cryptography'),
(177, '13', 'تعلم تقنيات جدار الحماية، IDS, honeypot, أدوات التهرب، والتدابير المضادة.', ''),
(178, '13', 'تعلم مختلف مفاهيم الحوسبة السحابية, التهديدات, الهجمات, التقنيات, والأدوات الأمنية.', ''),
(179, '13', 'تعلم الأنواع المختلفة لشيفرات التشفير، البنية التحتية للمفتاح العام (PKI)، هجمات التشفير، وأدوات تحليل الشيفرات.', ''),
(180, '13', 'تعلم الأنواع المختلفة لاختبار الاختراق، التدقيق الأمني، تقييم نقاط ومواطن الضعف، وخارطة اختبار الاختراق.', ''),
(181, '13', 'تعلم كيفية تحليل قابلية التأثر لتحديد الثغرات الأمنية في الشبكات المستهدفة والبنية التحتية للاتصالات والأنظمة الطرفية.', ''),
(182, '13', 'تعلم مختلف التهديدات التي تواجه منصات إنترنت الأشياء IoT وتعلم كيفية الدفاع عن أجهزة IoTبأمان.', ''),
(183, '14', '\r\nفهم أساسيات الشبكات وبناء شبكات محلية LAN بسيطة.', 'Introduction'),
(184, '14', '\r\nتمكين المشاركين من إدارة أجهزة الشبكة (المبدل والمحول).', 'Section 1 (LAB Preparation Tools):'),
(185, '14', '\r\nتمكين المشاركين من إنشاء اتصال إنترنت.', 'Section 2 (Network Fundamentals):'),
(186, '14', '\r\nتمكين المشاركين من إدارة الإصدارين الرابع والسادس من بروتوكول الإنترنت ipv4 و ipv6.\r\n', 'Section 3 (Network Devices Basic Idea Access Configuration):'),
(187, '14', 'تمكين المشاركين من استكشاف أخطاء اتصال عناوين الأجهزة IP.', 'Section 4 (Network Access):'),
(188, '14', '\r\nفهم أساسيات الإصدار السادس من بروتوكول الإنترنت IPv6.', 'Section 5 (IP Connectivity)'),
(189, '14', '\r\nتمكين المشاركين من استكشاف مشكلات الشبكات التخيلية VLAN وإصلاحها.', 'Section 6 (IP Services)'),
(190, '14', '\r\nتعلم كيفية تكوين بروتوكول الجذع Trunk.', 'Section 7 (Security Fundamentals):\r\n'),
(191, '14', '\r\nتعلم كيفية تكوين بروتوكول الشجرة الممتدة.', 'Section 8 (Automation and Programmability):'),
(192, '14', '\r\nتعلم كيفية تهيئة بروتوكول VTP على محول Cisco.', 'Conclusion'),
(193, '14', 'تعلم كيفية تكوين Port Security لشبك الأجهزة بأحد مخارج التحويل.', ''),
(194, '14', '\r\nتمكين المشاركين من تكوين EtherChannel.', ''),
(195, '14', '\r\nتمكين المشاركين من إدارة أمان أجهزة الشبكة.', ''),
(196, '14', '\r\nتمكين المشاركين من إنشاء شبكة لاسلكية.', ''),
(197, '15', '\r\nتمكين المشاركين من ادراك مفهوم التدريب والبرنامج التدريبي', 'المقدمة'),
(198, '15', '\r\nتعريف المشاركين على اهم المعارف والمهارات التي يجب أن يمتلكها المدرب', '\r\nالمدرب والتدريب'),
(199, '15', '\r\nتمكين المشاركين من التمييز بين أنماط التعلم الاساسية للمتدربين', '\r\nالمتدرب وأنماط المتدربين'),
(200, '15', '\r\nتمكين المشاركين من تنفيذ الانشطة الرئيسية بالتدريب', '\r\nالعملية التدريبية'),
(201, '15', 'إدراك المشاركين بأهمية معاملة المتدربين على أنهم متعلمون رائعون', 'التنفيذ وتقييم البرنامج التدريبي'),
(202, '15', '\r\nاظهار اتجاه ايجابي نحو أهمية تقديم تدريب تفاعلي وليس معتمد على التلقين', 'الخاتمة'),
(203, '15', '\r\nتعريف المشاركين على خصائص التعلم وكيفية توظيفها لتقديم تدريب ناجح', ''),
(204, '16', 'تعريف المشاركين على مدى تأثير الرياضة على وظائف الأعضاء وتركيبة الجسم.', '\r\nالتشريح العضلي'),
(205, '16', '\r\nاكساب المشاركين القدرة على إعداد برامج التدريب وتقييمات اللياقة واستخداماتها.', 'فسيولوجيا التدريب الرياضي'),
(206, '16', '\r\nتعريف المشاركين على المفاهيم والمبادئ المتعلقة بالتشريح العضلي وكذلك علم الحركة والميكانيكا الحيوية.', 'علم الحركة والميكانيكا الحيوية'),
(207, '16', '\r\nتعلم فسيولوجيا التدريب الرياضي بالإضافة إلى كيفية الإعداد البدنى ومبادىء التدريب.', '\r\nالإعداد البدنى ومبادىء التدريب'),
(208, '16', '\r\nاكساب المشاركين القدرة على إعداد برامج التغذية الرياضية الصحيحة وإطلاعهم على المكملات الغذائية.', '\r\nالتغذية الرياضية الصحيحة'),
(209, '16', 'تمكين المشاركين من تقييم اللياقة البدنية, تصميم البرنامج التدريبي, والتعامل مع المتدرب.', '\r\nالمكملات الغذائية'),
(210, '16', '', 'تقييم اللياقة البدنية'),
(211, '16', '', 'كيفية تصميم البرنامج التدريبي'),
(212, '16', '', '\r\nكيفية التعامل مع المتدرب'),
(213, '17', 'تمكين المشاركين من إنشاء وإدارة أوراق عمل وصفحات إكسل Excel.\r\n', 'المقدمة'),
(214, '17', 'اكتساب المهارات اللازمة لتخصيص الخيارات وطريقة العرض الخاصة بأوراق وصفحات العمل وتجهيزها للطباعة.', '\r\nالتعريف بواجهة التطبيق'),
(215, '17', 'اكتساب القدرة على إدارة الخلايا والبيانات وإدراجها وكذلك تنسيق الرسوم البيانية وجداول الإكسل.', '\r\nالعمليات الأساسية من قائمة ملف وتحسين الأداء'),
(216, '17', 'علم كيفية عرض البيانات باستخدام الجداول والرسوم البيانية.', '\r\nتقنيات التحديد'),
(217, '17', 'تمكين المشاركين من تعديل الصور وتمييز الخلايا وتصفيتها وفرزها وتجميعها.', 'ادخال البيانات'),
(218, '17', 'تمكين المشاركين من إنشاء صيغ في الإكسل وإنشاء تقارير باستخدام الدالات.', 'العمليات الأساسية على المصنف'),
(219, '17', '', '\r\nتنسيق النصوص'),
(220, '17', '', 'تنسيق الأرقام'),
(221, '17', '', '\r\nالتنسيق الشرطي'),
(222, '17', '', '\r\nتحليل البيانات'),
(223, '17', '', '\r\nالترتيب والتصفية'),
(224, '17', '', '\r\nالعمليات في اكسل'),
(225, '17', '', '\r\nاستخدام المخططات'),
(226, '17', '', '\r\nاعداد الصفحة والطباعة'),
(227, '17', '', 'الخاتمة'),
(228, '18', '\r\nمقدمة حول MS Excel', 'التنسيق'),
(229, '18', '\r\nتعريف المشاركين بأهمية MS Excel في الحياة اليومية', '\r\nأوراق العمل'),
(230, '18', '\r\nتمكين المشاركين من فهم MS Excel وكافة المعلومات الخاصة به.', '\r\nالدوال و الاقترانات'),
(231, '18', '\r\nمنح المشاركين المهارات المطلوبة لاستخدام برنامج اكسل بإتقان', 'المخططات'),
(232, '18', '', '\r\nتحليل البيانات'),
(233, '18', '', 'تحسين الإنتاجية (تقيد الادخال/ التعقب)'),
(234, '18', '', 'الطباعة'),
(235, '18', '', 'الخاتمة'),
(236, '19', '\r\nتعزيز الثقة بمؤسسات العمل الخيري', '\r\nتهيئة وتقديم'),
(237, '19', '\r\nتسهيل مهمة استقطاب الداعمين والمحسنين', '\r\nالتسويق في العمل الخيري'),
(238, '19', '\r\nتفعيل وإبراز دور التسويق في العمل الخيري', 'التسويق الإعلامي وبناء الخطة الإعلامية'),
(239, '19', '\r\nوضع الاستراتيجيات التسويقية للعمل الخيري', '\r\nبناء وتنفيذ الإستراتيجية التسويقية للعمل الخيري'),
(240, '19', '\r\nآليات تسويق المشاريع', '\r\nالمهارات الإعلامية'),
(241, '19', 'معالجة العديد من التحديات التي يواجهها العمل الخيري', '\r\nالعلاقات العامة'),
(242, '19', '\r\nبناء ثقافية مؤسسية للعمل الخيري', 'استقطاب الداعمين'),
(243, '19', '\r\nوضع المجتمع المحلي في الصورة الحقيقية للعمل الخيري', ''),
(244, '19', '\r\nالتركيز على الإستدامة والتمكين للعمل الخيري', ''),
(245, '19', 'التعامل المهني مع وسائل الإعلام المختلفة', ''),
(246, '20', '\r\nتعزيز الثقة بمؤسسات العمل الخيري', '\r\nتهيئة وتقديم'),
(247, '20', '\r\nتسهيل مهمة استقطاب الداعمين والمحسنين', '\r\nالتسويق في العمل الخيري'),
(248, '20', 'تفعيل وإبراز دور التسويق في العمل الخيري', 'التسويق الإعلامي وبناء الخطة الإعلامية'),
(249, '20', '\r\nوضع الاستراتيجيات التسويقية للعمل الخيري', '\r\nبناء وتنفيذ الإستراتيجية التسويقية للعمل الخيري'),
(250, '20', '\r\nآليات تسويق المشاريع', '\r\nالمهارات الإعلامية'),
(251, '20', '\r\nمعالجة العديد من التحديات التي يواجهها العمل الخيري', 'العلاقات العامة'),
(252, '20', 'بناء ثقافية مؤسسية للعمل الخيري\r\n', '\r\nاستقطاب الداعمين'),
(253, '20', '\r\nوضع المجتمع المحلي في الصورة الحقيقية للعمل الخيري', ''),
(254, '20', '\r\nالتركيز على الإستدامة والتمكين للعمل الخيري', ''),
(255, '20', '\r\nالتعامل المهني مع وسائل الإعلام المختلفة', ''),
(256, '21', '\r\nتعريف المشاركين بالمبادئ والمفاهيم العامة والجوانب القانونية للموارد البشرية.', 'ما هي إدارة الموارد البشرية'),
(257, '21', '\r\nاحتراف مجال الموارد البشرية وكذلك التواصل مع خبراء المجال والمساعدة في البحث عن عمل.', '\r\nإدارة الموارد البشريةvs. إدارة شؤون الموظفين.'),
(258, '21', 'تمكين المشاركين من إضافة ميزة تنافسية للمؤسسات بموظفيها المعتمدين بالإضافة إلى اعتبارهم ضمان للعملاء عن طريق مصداقيتهم.', '\r\nوظائف إدارة الموارد البشرية الرئيسية.'),
(259, '21', '\r\nإكساب المشاركين الخبرة العملية والمعرفة العلمية للعمل في مجال إدارة الموارد البشرية في مختلف قطاعات الأعمال.', 'مسؤوليات قسم الموارد البشرية.'),
(260, '21', '\r\nتزويد المشاركين بالمعلومات النظرية والتطبيقات العملية في قانون العمل الأردني بالشكل الذي ينمي مهاراتهم ويرفع قدراتهم في التعامل مع كافة المعادلات الواردة في القانون', '\r\nتاريخ إدارة الموارد البشرية.'),
(261, '21', 'تعريف المشاركين بالقواعد الأساسية للضريبة ونظريات حق الدولة في فرض الضرائب وتعريفهم بإجراءات ضريبة الرواتب والأجور وكيفية اقتطاعها وتوريدها.', 'الثقافة التنظيمية.'),
(262, '21', '', '\r\nالشخصيات في مكان العمل (طريقة DISC).'),
(263, '22', '\r\nالتخطيط والتحليل المالي وكذلك المراقبة المالية، اتخاذ القرار، والأخلاقيات المهنية.', 'المقدمة'),
(264, '22', 'فهم دور المحاسب الإداري في مجال إدارة المخاطر، اتخاذ القرارات الداخلية، التخطيط وإدارة التكاليف، وضع الميزانية ... إلخ.', '\r\nالوحدة 1: إعداد التقارير المالية الخارجية'),
(265, '22', '\r\nالاستعداد لتقديم امتحانات المحاسب الإداري المعتمد CMA الدولية.', 'الوحدة 2: التخطيط والميزانية والتنبؤ'),
(266, '22', '\r\nاكتساب المهارات اللازمة للحصول على شهادة المحاسب الإداري المعتمد CMA الدولية والتي تعكس الكفاءة والمهارات العملية للمحاسبين لتمكينهم من الحصول على مناصب كبيرة في عالم المحاسبة.', 'الوحدة 3: إدارة الأداء'),
(267, '22', '', '\r\nالوحدة 4: إدارة التكلفه'),
(268, '22', '', '\r\nالوحدة 5: الرقابة الداخلية'),
(269, '22', '', '\r\nالوحدة 6: التكنولوجيا والتحليلات'),
(270, '22', '', 'الخاتمة'),
(271, '23', '\r\nالتعرف على دور إدارة سلاسل الامداد و أهميتها داخل الشركات.', 'المقدمة'),
(272, '23', '\r\nتعلم التخطيط لسلسلة التوريد وصنع القرارات، وتصميم وتحليل سلاسل التوريد.', '\r\nأسس وتاريخ إدارة الموارد – Supply Chain'),
(273, '23', '\r\nتمكين المشاركين من تحليل عمليات الشركة من خلال فهم مؤشرات قياس الأداء.', 'الدخول في أعماق سلاسل الإمداد والتزويد'),
(274, '23', '\r\nتمكين المشاركين من تطبيق مفاهيم سلاسل الامداد وتخطيط العمليات توافقاً مع استراتيجية الشركة.', '\r\nالسلسلة الأولى – التخطيط'),
(275, '23', '\r\nتمكين المشاركين من تطبيق مفاهيم عملية الشراء والعمليات اللوجستية لتحسين عمليات سلسلة التوريد.', '\r\nقسم المشتريات'),
(276, '23', '\r\nتمكين المشاركين من فهم تطبيق أدوات التجارة الدولية.', '\r\nقسم اللوجستية'),
(277, '23', '', 'قسم المستودعات'),
(278, '23', '', '\r\nسعادة العميل'),
(279, '23', '', '\r\nالأرشفة الإلكترونية لجميع العمليات'),
(280, '23', '', '\r\nترابط المنظومه ومستقبل سلاسل الإمداد والتزويد'),
(281, '23', '', '\r\nالربط مع الشركات العالمية'),
(282, '23', '', 'الخاتمة'),
(283, '24', '\r\nمعرفة طرق وأدوات واستراتيجيات التسويق الإلكتروني وكيفية استخدامها في تسويق السلع والخدمات', 'Introduction'),
(284, '24', '\r\nكيفية العمل على اعلانات جوجل وتحليل البيانات', 'Introduction to Digital Marketing'),
(285, '24', '\r\nتطوير محركات البحث seo, sem', 'Website Development'),
(286, '24', '\r\nفتح اسواق جديدة محلية ودولية لتصدير المنتجات للخارج', 'Search Engine Optimization'),
(287, '24', '\r\nالتسويق بالعمولة', 'Google Ads'),
(288, '24', '\r\nالتعرف علي كيفية حل المشاكل التي تعترض عملية التسويق وكيفية إيجاد البدائل', 'CRO & Lead Generation'),
(289, '24', 'الانتقال الى عالم التسويق الاحترافي على مواقع التواصل الاجتماعي باحترافية', 'Google analytics'),
(290, '24', '', 'Content Marketing'),
(291, '24', '', 'Email Marketing'),
(292, '24', '', 'Affiliate Marketing'),
(293, '24', '', 'Social Media Marketing (SMM)'),
(294, '24', '', 'Mobile and Proximity Marketing'),
(295, '24', '', 'Strategy and Planning'),
(296, '24', '', 'Conclusion'),
(297, '25', 'معرفة إعداد وتنفيذ الخطط الإستراتيجية بكفاءة.', 'المقدمة'),
(298, '25', '\r\nتحديد نقاط القوة والضعف والفرص والتحديات التي تواجه المنشآت.', '\r\nالادارة ومفهومها'),
(299, '25', '\r\nتحديد الأهداف الرئيسية وتصميم الخطط الإستراتيجية.', 'التخطيط'),
(300, '25', '\r\nإدراك المفاهيم والمعارف المرتبطة بالتخطيط الإستراتيجي وإدارة الأداء', '\r\nتحليل الوضع الراهن (التحليل الاستراتيجي )'),
(301, '25', '', 'رسم الرؤية والمهمة والقيم والأهداف'),
(302, '25', '', 'الوسائل'),
(303, '25', '', 'الخاتمة'),
(304, '26', 'تعلم كيفية نمذجة المشاهد الداخلية والخارجية وإضافة التأثيرات الطبيعية بالإضافة إلى تصميم المناظر الطبيعية.', 'Course Introduction'),
(305, '26', '\r\nتمكين المشاركين على كيفية الإكساء وخلط الألوان, التعامل مع الكاميرا داخل المشهد, وكذلك أدوات الإضاءة في نظام فيري.', 'Module 1: Getting Started with Autodesk 3ds Max 2021'),
(306, '26', 'تمكين المشاركين على كيفية الإكساء وخلط الألوان, التعامل مع الكاميرا داخل المشهد, وكذلك أدوات الإضاءة في نظام فيري.', 'Module 2: Helpers'),
(307, '26', 'تمكين المشاركين على كيفية التعامل مع الإضاءة للفراغ الخارجي وإضافة الخلفيات, ومعرفة الأدوات المتقدمة في التعديل على أشكال البولي.', 'Module 3: Shapes'),
(308, '26', '\r\nتمكين المشاركين من استخدام المواد والإضاءة والكاميرات القياسية والفي راي V-Ray بطريقة احترافية.', 'Module 4: Compound Objects'),
(309, '26', '\r\nتمكين المشاركين من تحريك الكائنات في المشاهد وإنشاء وصنع مقاطع الفيديو عن طريق ضبط الوقت والحركة.', 'Module 5: Draw Objects'),
(310, '26', '', 'Module 6: AEC and Stairs\r\n'),
(311, '26', '', 'Module 7: Modify'),
(312, '26', '', 'Module 8: Clothing'),
(313, '26', '', 'Conclusion'),
(314, '27', '\r\nتعلم المفاهيم الأساسية ومميزات أدوبي افتر افكت', 'Getting to Know the Workflow'),
(315, '27', '\r\nتعلم المفاهيم الأساسية ومميزات أدوبي افتر افكت', 'Creating a Basic Animation Using Effects and Presets'),
(316, '27', '\r\nتمكين المشاركين من إنشاء الرسوم المتحركة والتأثيرات البصرية, تحريك الصور والفيديو في ابعاد ثنائية و ثلاثية 2D و3D, وإعداد الموشن جرافيك والخدع السينمائية.', 'Animating Text'),
(317, '27', '\r\nتمكين المشاركين من إنشاء الرسوم المتحركة والتأثيرات البصرية, تحريك الصور والفيديو في ابعاد ثنائية و ثلاثية 2D و3D, وإعداد الموشن جرافيك والخدع السينمائية.', 'Working with Shape Layers'),
(318, '27', 'تمكين المشاركين من تحديد والابتعاد عن أخطاء التسويق الإلكتروني المكلفة.', 'Animating a Multimedia Presentation'),
(319, '27', '', 'Animating Layers'),
(320, '27', '', 'Working with Masks'),
(321, '27', '', 'Distorting Objects with the Puppet Tools'),
(322, '27', '', 'Using the Roto Brush Tool'),
(323, '27', '', 'Performing Color Correction'),
(324, '27', '', 'Creating Motion Graphics Templates'),
(325, '27', '', 'Using 3D Features'),
(326, '27', '', 'Working with the 3D Camera Tracker'),
(327, '27', '', 'Advanced Editing Techniques'),
(328, '27', '', 'Rendering and Outputting'),
(329, '28', '\r\nتعلم كيفية الإكساء وخلط الألوان, التعامل مع الكاميرا داخل المشهد, وكذلك أدوات الإضاءة في نظام فيري.', 'Module 1: Material and Map Theory'),
(330, '28', '\r\nتعلم كيفية التعامل مع الإضاءة للفراغ الخارجي وإضافة الخلفيات, بالإضافة إلى الأدوات المتقدمة في التعديل على أشكال البولي.', 'Module 2: V-Ray customization and set up'),
(331, '28', '\r\nتمكين المشاركين من استخدام المواد والإضاءة والكاميرات القياسية والفي راي V-Ray بطريقة احترافية.', 'Module 3: V-Ray Physical Material'),
(332, '28', '', 'Module 4: V-Ray Fur (Grass)'),
(333, '28', '', 'Module 5: V-Ray Lighting Introduction'),
(334, '28', '', 'Module 6: Render First Scene'),
(335, '28', '', 'Module 7: Post-Production'),
(336, '29', '\r\nفهم الأدوات والأدوار الأساسية لبرنامج أدوبي بريميير.', 'Introduction'),
(337, '29', '\r\nتعلم كيفية إعداد وإدارة المشاريع وكذلك استيراد وتنظيم الوسائط.', 'Introduction To Premiere Pro'),
(338, '29', 'اتقان أساسيات تحرير وتعديل الفيديوهات.', 'Importing Assets'),
(339, '29', '\r\nتمكين المشاركين من العمل مع المقاطع المختلفة.', 'Basic Editing Techniques'),
(340, '29', '\r\nتعلم تقنيات التحرير المتقدمة.', 'Creating Titles'),
(341, '29', '\r\nتمكين المشاركين من إضافة المؤثرات الانتقالية ووضع مقاطع متحركة وإضافة تأثيرات الفيديو.', 'Working With Effects'),
(342, '29', '\r\nتمكين المشاركين من تحرير ودمج مقاطع الصوت.', 'Transitions'),
(343, '29', '\r\nتمكين المشاركين من تطوير وتحسين المقاطع من خلال تصحيح الألوان.', 'Stabilizing Footage'),
(344, '29', '\r\nتعلم كيفية تصدير الإطارات, المقاطع, والتسلسلات.', 'Chroma Keying'),
(345, '29', '', 'Advanced Editing'),
(346, '29', '', 'Introduction Motion'),
(347, '29', '', 'Audio'),
(348, '29', '', 'Exporting'),
(349, '29', '', 'Final Project'),
(350, '31', '\r\nتعلم كيفية رسم المخططات ثلاثية الأبعاد باستخدام برنامج السكتش أب وكذلك تعلم إضافة المواد والإشعاع والحيوية.', 'The Sketchup Interface'),
(351, '31', '\r\nتمكين المشاركين من رسم وتصميم المخططات المعمارية او الداخلية بكامل ابعادها وتفاصيلها مع المقاطع والمشاهد ثلاثيه وثنائيه الأبعاد بطرق سهلة وسريعة.', 'Drawing In Sketchup'),
(352, '31', '\r\nتمكين المشاركين من رسم التفاصيل الداخلية مثل المطابخ والأثاث الداخلي بطرق احترافية.', 'Organizing Scenes'),
(353, '31', 'تمكين المشاركين من إخراج إظهار داخلي وخارجي v-ray.', 'Importing'),
(354, '31', '', 'Creating Textures And Applying Materials'),
(355, '31', '', 'Lighting Scenes'),
(356, '31', '', 'Rendering And Animation'),
(357, '31', '', 'Creating Terrain Using Sandbox Contours'),
(358, '31', '', 'Vray'),
(359, '32', '\r\nتعريف المشاركين على المفاهيم الأساسية ومميزات أدوبي فوتوشوب.', 'Introduction'),
(360, '32', '\r\nاكساب المشاركين مهارة إنشاء مستند جديد من الصفر للطباعة الرقمية.', 'Retouching'),
(361, '32', '\r\nاكساب المشاركين مهارة إنشاء التصاميم البصرية المتنوعة والصور المتحركة.', 'Selection tools'),
(362, '32', '\r\nتمكين المشاركين من إجراء التعديلات البسيطة على مقاطع الفيديو في الإصدارات الحديثة.', 'layers'),
(363, '32', '\r\nاكساب المشاركين مهارة تعديل الصور الفوتوغرافية والتلاعب بالصور والتصميمات.', 'Exercises'),
(364, '32', '\r\nاحتراف فن تعديل وترميم الصور وكذلك التلاعب بها.', 'Transforming'),
(365, '32', '\r\nتعريف المشاركين على طريقة استعادة الصور باستخدام أدوات الاقتصاص القائمة على قواعد التصوير الفوتوغرافي.', '\r\nLight and Color Correction'),
(366, '32', '\r\nإلمام المشاركين بمهارة معالجة الصور وتصحيحها باستخدام الفلاتر وتعديل الألوان.\r\n', 'Conclusion'),
(367, '32', '\r\nاحتراف مهارة الطبقات واستخدام الأنماط في التصاميم.', ''),
(368, '32', 'زيادة إنتاجية وكفاءة المشاركين من خلال تعلم اختصارات لوحة المفاتيح ذات الصلة.', ''),
(369, '33', '\r\nتعلم المفاهيم الأساسية ومميزات أدوبي اليستريتور\r\n', ''),
(370, '33', '\r\nاكتساب مهارات جيدة في التصميم وكذلك الرسومات المتجهة.', 'Introduction'),
(371, '33', '\r\nتمكين المشاركين من التعامل مع أنظمة القياس.\r\n', 'Starting Illustrator'),
(372, '33', '\r\nتمكين المشاركين من إنشاء مستندات وتخطيطات جديدة من الصفر لأنظمة الطباعة والقراءة الرقمية.', 'Objects'),
(373, '33', '\r\nتعلم العمل مع النقاط والمسارات.', 'Transforming Objects'),
(374, '33', '\r\nتعلم العمل مع الألوان وتصدير الوثائق وكذلك التعامل مع الخطوط.', 'Fill and Strokes'),
(375, '33', '\r\nتمكين المشاركين من إنشاء تصاميم لصفحات ويب واضحة وللهواتف النقالة.', 'Type'),
(376, '33', '\r\nتعلم التلوين والإسقاط.', 'Modify Objects'),
(377, '33', '\r\nتمكين المشاركين من استيراد ملفات متعددة في نفس الوقت، وتعلم تصميم ناقلات متعددة', 'Points and Path\r\n'),
(378, '33', 'زيادة إنتاجية وكفاءة المشاركين من خلال تعلم اختصارات لوحة المفاتيح ذات الصلة.', 'conclusion'),
(379, '33', 'التعرف على أدوات وتقنيات البرنامج .', ''),
(392, '34', 'تمكين المشاركين من تطوير مشاريع وحملات التسويق عبر وسائل التواصل الإجتماعية المختلفة, وتحسين إستراتيجيات التسويق عبر وسائل التواصل الإجتماعي', 'Introduction\r\nDefinition of marketing\r\nMarketing stages throughout history\r\nThe difference between logo and brand\r\nHow do I get started?\r\nBrand personality styles\r\nMarketing strategy\r\nMarketing plan\r\nMarketing research\r\nMarketing objectives\r\nMarketing mix\r\nThe marketing mix of services\r\nPromotion mix\r\nThe difference between commercials and advertising'),
(393, '34', 'تمكين المشاركين من الوصول إلى العملاء المستهدفين من خلال منصات التواصل الإجتماعية المختلفة وشبكة الانترنت.', 'Social media\r\nAdvertising and its tools\r\nThe target audience\r\nContent\r\nMarketing and subconscious mind\r\nCustomer service\r\nNumbers in the social media service\r\nCustomer Service Tips\r\nExcellence in customer service on social media platforms\r\nTools of Excellence\r\nYouTube\r\nInstagram\r\nSnapchat\r\nTwitter\r\nLinkedIn'),
(394, '34', 'التعرف على التفاعل المستمر وتحسين التواصل مع العملاء.', 'Facebook\r\nLog in to Facebook\r\nIntroduction to Facebook and its tools\r\nPersonal account settings\r\nCreate a business page\r\nBusiness page settings\r\nPage administration vs campaign promotion\r\nDo I boosting the post?\r\nAds manager\r\nThe structure of the advertisement\r\nDetermine the budget\r\nLifetime ad? Facebook learns?\r\nDetermine the target audience\r\nPlace of advertisement\r\nPreparing the advertisement\r\nReach Ads\r\nCampaign loop - types of interaction ads\r\nTraffic Ads'),
(395, '34', '\r\nتمكين المشاركين من تطوير العلاقة مع الزبائن بشكل كبير وجذب العملاء الجدد وتوسيع قاعدة العملاء.', 'Engagement Ads\r\nInstall App Ads\r\nVideo Views Ads\r\nLead Generation Ads\r\nMessages Ads\r\nGroup of conversion Ads\r\nAdvertise the conversion\r\nCatalog Sales Ads\r\nStore location Ads\r\nAdvance - Audience\r\nAdvance - Custom Audience - Customer list\r\nAdvance - Facebook Audience\r\nAdvance - look-a-like Audience\r\nFacebook Event - Pixel\r\nAdvance - Creator Studio\r\nAdvance - Business account\r\nConclusion'),
(396, '34', 'تعلم كيفية تنظيم طرق تكنولوجيا الاتصالات الحديثة.', ''),
(397, '34', '\r\nتمكين المشاركين من تحديد والابتعاد عن أخطاء التسويق الإلكتروني المكلفة.', '');

-- --------------------------------------------------------

--
-- Structure de la table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `livecourses`
--

CREATE TABLE `livecourses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `livecourses`
--

INSERT INTO `livecourses` (`id`, `name`, `image`, `created_at`, `updated_at`) VALUES
(1, 'البرمجة', '1.svg', NULL, NULL),
(2, 'الشبكات وامن المعلومات', '5.svg', NULL, NULL),
(3, 'الادارة والمحاسبة', '6.svg', NULL, NULL),
(4, 'التصميم الجرافيكي والمعماري', '4.svg', NULL, NULL),
(5, 'اللغات', '2.svg', NULL, NULL),
(6, 'تكنولوجيا التعليم الرقمي', '11.svg', NULL, NULL),
(7, 'الهندسة', '3.svg', NULL, NULL),
(8, 'مهارات الحاسوب', '7.svg', NULL, NULL),
(9, 'ادارة المطارات و علوم السياحة و السفر', '12.svg', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_reset_tokens_table', 1),
(3, '2014_10_12_100000_create_password_resets_table', 1),
(4, '2019_08_19_000000_create_failed_jobs_table', 1),
(5, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(6, '2023_10_04_173133_create_recordcourses_table', 1),
(7, '2023_10_04_210531_create_livecourses_table', 2),
(8, '2023_10_05_150756_create_allrecords_table', 3),
(9, '2023_10_07_175502_create_addtocarts_table', 4);

-- --------------------------------------------------------

--
-- Structure de la table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `recordcourses`
--

CREATE TABLE `recordcourses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `recordcourses`
--

INSERT INTO `recordcourses` (`id`, `name`, `image`, `created_at`, `updated_at`) VALUES
(1, 'البرمجة', '1.svg', NULL, NULL),
(2, 'الشبكات و امن المعلومات\r\n', '5.svg', NULL, NULL),
(3, 'الادارة و المحاسبة \r\n', '6.svg', NULL, NULL),
(4, 'التصميم الجرافيكي و المعماري', '4.svg', NULL, NULL),
(5, 'اللغات\r\n', '2.svg', NULL, NULL),
(6, 'تكنولوجيا التعليم الرقمي', '11.svg', NULL, NULL),
(7, 'الهندسة', '3.svg', NULL, NULL),
(8, 'مهارات الحاسوب \r\n', '7.svg', NULL, NULL),
(9, ' الادارة الطبية والتجميل ', '13.svg', NULL, NULL),
(10, 'ادارة المطارات و علوم السياحة و السفر', '12.svg', NULL, NULL),
(11, 'النفط و الغاز', '14.svg', NULL, NULL),
(12, 'القانون ', '8.svg', NULL, NULL),
(13, 'السلامة و الصحة المهنية', '15.svg', NULL, NULL),
(14, 'الصحافة و الاعلام الرقمي', '10.svg', NULL, NULL),
(15, 'تصميم الأزياء', '16.png', NULL, NULL),
(16, 'تصميم المجوهرات\r\n', '9.svg', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'monsef', 'xr.monsef@gmail.com', NULL, '$2y$10$VaDS7I6TYM.Q2sd1WsGi6Oxy5wYRJoIuxPuBQ3PXdbmGwj1Y7nTcW', NULL, '2023-10-05 10:52:42', '2023-10-05 10:52:42'),
(2, 'monsef', 'win.monsef@gmail.com', NULL, '$2y$10$CSbgMppllD3anPeJDk.MR.lp7nq.9NtchODeypi00jwCSTLJKZo3S', NULL, '2023-10-07 21:31:06', '2023-10-07 21:31:06');

--
-- Index pour les tables déchargées
--

--
-- Index pour la table `allrecords`
--
ALTER TABLE `allrecords`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `desccourse`
--
ALTER TABLE `desccourse`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Index pour la table `livecourses`
--
ALTER TABLE `livecourses`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Index pour la table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Index pour la table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Index pour la table `recordcourses`
--
ALTER TABLE `recordcourses`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT pour les tables déchargées
--

--
-- AUTO_INCREMENT pour la table `allrecords`
--
ALTER TABLE `allrecords`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;

--
-- AUTO_INCREMENT pour la table `desccourse`
--
ALTER TABLE `desccourse`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=398;

--
-- AUTO_INCREMENT pour la table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `livecourses`
--
ALTER TABLE `livecourses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT pour la table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT pour la table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `recordcourses`
--
ALTER TABLE `recordcourses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT pour la table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
